{"/about/":{"data":{"":"This site is built using Hextra to allow for publishing content relevant for vocational school in markdown format. The docs are created using Obsidian and then added to the folder structure. After that, the site is pushed to GitHub on the dev branch. From there vercel automatically builds the site and deploys it to the dev branch."},"title":"About"},"/docs/":{"data":{"contributing#Contributing":"","stay-connected#Stay Connected":"Welcome to the Documentation HubThis site hosts comprehensive documentation for vocational school content, carefully curated and maintained by Tim Matheis. Our goal is to provide clear, accurate, and accessible educational resources.\nContributing We welcome contributions from the community! If you’d like to help improve this documentation:\nCreate a pull request on our GitHub repository Follow our folder structure and naming conventions Ensure your contributions are accurate and well-documented Contact me directly for any questions or suggestions Stay Connected Feel free to reach out through:\nEmail: mail@timmatheis.com X (Twitter): @YouHuckleberry ","welcome-to-the-documentation-hub#Welcome to the Documentation Hub":""},"title":"_index"},"/docs/bgp/beschaffungsprozess/":{"data":{"":"Ablauf des Beschaffungsprozesses:\nBedarfsanalyse Kundenwünsche ermitteln Lieferanten recherieren Angebote anfragen Angebote vergleichen \u0026 Entscheidung treffen Bestellung bei Lieferanten Bestellbestätigung Warenlieferung durch Lieferanten Warenannahme 1. 1. Einlagerung 2. Warenprüfung 3. mögl. Mängelfeststellung 2. 1. Rechnung 2. Zahlung durch Kunde "},"title":"Beschaffungsprozess"},"/docs/bgp/bezugskalkulation/":{"data":{"":"Definition: Ermittlung des Bezugspreises (auch Einstandspreis genannt) von Gütern zum Vergleich von Angeboten. Um Angebote über Güter von Lieferanten zu vergleichen ist die Kalkulation des Bezugspreises/Einstandspreises von Nöten. Zur Kalkulation werden die Faktoren der Angebote gegengerechnet um den finalen Preis je Angebot zu berechnen. Dabei wird (sofern möglich) der Preis immer pro Stück berechnet. Dabei werden auch Frachtkostenpauschalen durch die Anzahl der gekauften Einheiten geteilt und addiert.","table-of-contents#Table of Contents":" [[#Hauptkriterium|Hauptkriterium]] [[#Andere Kriterien|Andere Kriterien]] [[#Anfragen und Angebote|Anfragen und Angebote]] [[#Beispiel|Beispiel]] Hauptkriterium Das Hauptkriterium, warum sich Unternehmen für einen Lieferanten gegenüber dem anderen Lieferanten entscheiden, ist der Preis. Die Berechnung des sogenannten Bezugspreises ist anzugeben.\nAndere Kriterien Es gibt noch weitere Entscheidungskriterien für den Kauf von Produkten außer dem Preis. Somit kann es möglich sein, dass ein Produkt/Lieferant dennoch einen Zuschlag erhält, obwohl er preislich im Nachteil liegt. Einiger dieser Kriterien sind folgende:\nLieferanten Qualität Unternehmensimage Erfahrung Kulanz Umweltschutz Onlinebewertungen Reaktionszeit Anfragen und Angebote Anfragen: Das Anfragen von Preisen bei einem Lieferanten beinhaltet keine rechtliche Bindung zur Entscheidung für diesen Lieferanten.\nAngebote: Die Abgabe eines Angebotes an einen Interessenten beinhaltet immer eine rechtliche Bindung, außer in dem Angebot sind Freizeichnungsklauseln oder zeitliche Beschränkungen angegeben.\nBeispiel Anschaffung von sechs Etikettendruckern.\nAngebot 1 von Kai Fit: Sehr geehrter Herr Birdman, zu unserem Etikettendrucker Tip-Top-VC-6 können wir Ihnen folgendes Angebot unterbreiten:\nPreis je Stück 94,00€ Verpackung und Fracht 25,00€ Ab 5 Stuck 5% Rabat 2% Skonto bei Zahlung innerhalb von 14 Tagen zzgl. 19% UST Zahlbar innerhalb von 30 Tagen nach Rechnungseingang Mit freundlichem Gruß Kai Fix\nAngebot 2 von Maier GmbH: sehr geehrter Herr Birdman, zu Ihrer Anfrage können wir Ihnen folgendes Angebot unterbreiten:\nEtikettendrucker Super-Duper-Extrem 3000\nPreis je Stück 99,00€ beim Kauf von 6 Stück Versandkostenpauschale 20,00€ zusätzlich 8% Sonderrabatt 3% Skonto bei Zahlung innerhalb von IO Tagen zzgl. 19% UST Zahlbar innerhalb von 30 Tagen nach Rechnungseingang Mit freundlichem Gruß i.A. Brennnessel Fritz\nKai Fit Maier GmbH Kalkulation % € % € Listeneinkaufspreis (LEP) 100% 94,00€ 100% 99,00€ - Lieferantenrabatt 5% 4,70€ 8% 7,92€ = Zieleinkaufspreis (ZEP) 95% 89,30€ 92% 91,08€ - Lieferantenskonto 2% 1,79€ 3% 2,73€ = Bareinkaufspreis (BEP) 98% 87,51€ 97% 88,35€ + Bezugskosten 4,17€ 3,33€ = Bezugspreis (BP) 91,68€ 91,68€ Nebenrechnungen: Für Kai Fit:\nLieferantenrabatt = 94,00€ / 100 * 5 = 4,70€ Zieleinkaufspreis = 94,00€ - 4,70€ = 89,30€ Lieferantenskonto = 89,30€ / 98 * 2 = 1,79€ Bareinkaufspreis = 89,30€ - 1,79€ = 87,51€ Bezugskostne je Stück = 25,00€ / 6 Stück = 4,17€/Stück Bezugspreis = 87,51€ + 4,17€ = 91,68€ Ergebnis: Beide Angebote sind preislich identisch."},"title":"Bezugskalkulation"},"/docs/bgp/kalkulationsschema/":{"data":{"":"","#":"Kalkulationsschema für produzierende Betriebe In einem produzierenden Betrieb wird die Zuschlagskalkulation angewendet, um die Gesamtkosten in Einzel- und Gemeinkosten zu trennen.\nOperator Position Materialeinzelkosten + Materialgemeinkosten = Materialkosten + Fertigungseinzelkosten + Fertigungsgemeinkosten + Sondereinzelkosten der Fertigung = Herstellkosten + Verwaltungsgemeinkosten + Vertriebsgemeinkosten + Sondereinzelkosten des Vertriebs = Selbstkosten + Gewinn = Barverkaufspreis + Kundenskonto + Vertreterprovision = Zielverkaufspreis + Kundenrabatt = Nettoverkaufspreis + Umsatzsteuer = Bruttoverkaufspreis Kalkulationsschema für Handelsbetriebe Bei Handelsunternehmen spricht man bei dieser Kalkulation von der sogenannten Handelskalkulation. Die [[Bezugskalkulation]], die sich vom Listeneinkaufspreis bis zum Bezugspreis erstreckt, bildet hierbei die elementare Basis.\nOperator Positon Listeneinkaufspreis - Lieferrabatt = Zieleinkaufspreis - Lieferskonto = Bareinkaufspreis + Bezugskosten = Bezugspreis/Einstandspreis + Handlungskostenzuschlag = Selbstkostenpreis + Gewinnzuschlag = Barverkaufspreis + Kundenskonto = Zielverkaufspreis + Kundenrabatt = Netto-Verkaufspreis + Umsatzsteuer = Brutto-Verkaufspreis Kalkulationsarten Vorwärtskalkulation: Berechnung ausgehend vom Listeneinkaufspreis. (Von oben nach unten im Schema)\nRückwärtskalkulation: Berechnung ausgehend vom Verkaufspreis. (Von unten nach oben im Schema)\nDifferenzkalkulation: Berechnung des Gewinns aus beiden Richtungen (Von oben nach unten bis zum Selbstkostenpreis und von unten nach oben bis zum Barverkaufspreis). Die Differenz aus Barverkaufspreis und Selbstkostenpreis ist der Gewinn des Unternehmens"},"title":"Kalkulationsschema"},"/docs/bgp/kundenw%C3%BCnsche/":{"data":{"":"Qualität -\u003e Haltbarkeit\nGünstig Produkte/Dienstleistung\nService \u0026 Support -\u003e Rückgaberecht, Garantie\nkurze Lieferzeiten\nNachhaltigkeit","erfassung-kundenbedürfnisse#Erfassung Kundenbedürfnisse":"Quantitative Methoden (Big Data) Umfragen Onlinenanalyse -\u003e Verweildauer auf der Website, Warenkorb, Verlauf Qualitative Methoden Feedback und Tests zu Produkten Persönliche Ansprache der Kunden im Geschäft Rückmeldungen von Mitarbeitern ","kanomodell#Kanomodell":"systematisches erreichen der Kundenzufriedenheit. Beschreibt Zusammenhang zwischen Dienstleistung/Produkt und der Kundenzufriedenheit\nMerkmale Basis-Merkmale Merkmale, welche selbstverständlich sind fallen nur auf, wenn diese fehlen Leistungs-Merkmale je besser, desto zufriedener der Kunde Begeisterungs-Merkmale werden nicht erwartet schafft Kundenzufriedenheit Unerhebliche-Merkmale spielt für den Kunden keine Rolle Rückweisungs-Merkmale ohne wird das Produkt nicht gekauft Produkt wird wieder zurückgesendet "},"title":"Kundenwünsche"},"/docs/bgp/produktionsfaktoren/":{"data":{"":"","#":"Definition: Produktionsfaktoren sind jene materiellen und immateriellen in der Herstellung verwendeten Güter.\nVolkswirtschaftliche Produktionsfaktoren originäre (ursprüngliche) Faktoren:\nNatur Arbeit derivative (abgeleitete) Faktoren:\nKapital Bildung "},"title":"Produktionsfaktoren"},"/docs/bgp/smart-prinzip/":{"data":{"":"Das SMART-Prinzip (auch Zielformel genannt) wird verwendet, um Ziele korrekt zu formulieren. Dabei steht jeder Buchstabe des Akronyms ‘SMART’ für eine Eigenschaft, welche die Formulierung des Ziels erfüllen sollte. Dabei stellt das SMART-Prinzip nur eine Mindestbeschreibung jener Ziele da.\nS (Spezifisch) genau beschrieben nachvollziehbar M (messbar) Erreichung des Ziels an Messzahlen ersichtlich A (attraktiv) Übereinstimmung mit den Wertevorstellungen des Unternehmens R (realistisch) Ziel muss realistisch sein T (terminiert) Terminieren des Erreichens eines Ziels "},"title":"SMART-Prinzip"},"/docs/bgp/unternehmensleitbild/":{"data":{"":"","#":"Definition: Es ist eine klar gegliederte, langfristige Zielvorstellung des Unternehmens und beinhaltete die Strategien mit welchen [[Unternehmensziele]] erreicht werden sollen. 1\nFunktionen des Unternehmensleitbildes Orientierungsfunktion Mitarbeiter sollen sich bei ihrem Handeln daran richten z.B.: Werte, Normen, Regeln, Vorbilder Integrationsfunktion Erschaffung eines ‘Wir-Gefühls’2 Entscheidungsfunktion Legt Regeln für Kriesen und Spielräume fest Diese gelten für das Unternehmen und die Führungskräfte Koordinierungsfunktion Verbesserung der Zusammenarbeit z.B. zwischen Mitarbeitern, Führungskräften, Kunden, Partnern und der Öffentlichkeit Probleme mit Unternehmensleitbildes Keine Möglichkeit der Änderung bestehender Muster Denken in Stereotypen Produktivitätsverlustes durch Mangel an Kreativität Mangelnde Identifikation mit Vorgaben des Unternehmens Es ist wichtig das Unternehmensleitbild von Zeit zu Zeit anzupassen, da sich Unternehmen und Welt verändern und dieses weiterhin zum Unternehmen passt.\nEs wird teilweise auch ‘Ausformulierung der Unternehmenskultur’ genannt. ↩︎\nDies nennt man auch Corporate Identit (Kommunikationsstrategie, Corporate Design, etc.). ↩︎"},"title":"Unternehmensleitbild"},"/docs/bgp/unternehmensziele/":{"data":{"":"","#":"Definition: Diese ermöglichen die Planung des Unternehmensgeschehen und zeigen einen zukünftig, erstrebenswerten Zustand eines Unternehmens auf. Zum Erreichen dieser kann das [[SMART-Prinzip]] verwendet werden.\nZiele Das oberste Ziel eines Unternehmens ist die Erwirtschaftung eines Gewinns.\nUnterziele Ökonomische Unterziele Umsatz steigern Kosten senken Effizienz steigern Unabhängigkeit Marktanteil erhöhen Ökologische Unterziele E-Mobilität Nachhaltige Energiequelle Grünflächenerhalt Regionale Lieferanten Soziale Unterziele Kundenzufriedenheit Sicherung und Erhaltung von Arbeitsplätzen Mitarbeiterförderung Zielarten Zielkonflikt1 stehen in Konkurrenz zueinander nicht gleichzeitig verfolgbar eine Näherung an beide Ziel unmöglich Zielharmonie2 Idealbeziehung bei Verfolgung des einen Ziels, wird sich einem anderen Ziel ebenfalls genähert indifferente Ziele3 gleichzeitig verfolgbar keine gegenseitige Einwirkung , auch konkurrierende Ziele genannt ↩︎\n, auch komplementäre Ziele genannt ↩︎\nz.B.: Betriebsklima verbessern und Mitarbeiterzufriedenheit erhöhen ↩︎"},"title":"Unternehmensziele"},"/docs/bgp/wirtschaftskreislauf/":{"data":{"":"","#":"Definition: Der Wirtschaftskreislauf1 beschreibt dem Umlaufprozess von Gütern den dafür aufgewendeten Zahlungsmitteln. Jeder Teilnehmer im Wirtschaftskreislauf bietet [[Produktionsfaktoren]]2 an.\neinfacher Wirtschaftskreislauf Ausgangspunkt:\nNur folgende Teilnehmer (Haushalt und Unternehmen) keine außenwirtschaftlichen Beziehungen es wird das gesamte Einkommen verbraucht es werden alle Güter verbraucht Die beiden Teilnehmer (Unternehmen und Haushalte) sind zu sog. Sektoren zusammengefasst.\n![[einfacher_Wirtschaftskreislauf.png]]\nerweiterter Wirtschaftskreislauf Ausgangspunkt:\nAlle folgende Teilnehmer (Haushalt, Unternehmen, Ausland, Staat, Finanzsektor) außenwirtschaftlichen Beziehungen es wird nur ein Teil des Einkommens verbraucht (Ersparnisbildung) es wird nur ein Teil der produzierten Güter verbraucht (Investitionszwecke) ![[erweiterter_wirtschaftskreislauf.png]]\nenglisch Circular flow of income ↩︎\njene materiellen und immateriellen in der Herstellung verwendeten Güter ↩︎"},"title":"Wirtschaftskreislauf"},"/docs/deutsch/aida-prinzip/":{"data":{"":"","#":"Definition: Das AIDA-Prinzip ein Stufenmodell zur Werbewirksamkeit. Die jeweiligen Buchstaben des Akronyms ‘AIDA’ stehen für den Anfangsbuchstaben des entsprechenden englischen Wortes.\nAttention (A) - Aufmerksamkeit erzeugen Der Anzeige soll die Betrachter näher beschäftigen. (Beispiel: Blickfang)\nInterest (I) - Interesse wecken Das Interesse des Betrachters an dem Produkt wecken.\nDesire (D) - Begehrlichkeit auslösen Erschaffung eines Bedürfnisses, diese Produkt zu besitzen.\nAction (A) - Handlungsaufruf einbinden Umsetzung des geweckten Bedürfnisses durch Kauf des Produkts."},"title":"AIDA-Prinzip"},"/docs/deutsch/werbeanalyse-kriterien/":{"data":{"":"","#":"Benötigte Kriterien Einleitung Welches Produkt wird beworben? Wer ist Auftraggeber der Werbung? Welche Zielgruppe wird angesprochen? Hauptteil Beschreibung der Werbeanzeige: Wie ist die Anordnung von Bild und Text? Wie ist das Verhältnis von Bild und Text? Analyse des Bildes: Worauf wird die Aufmerksamkeit gelenkt? Ist das Produkt direkt präsentiert? Wie ist die Umgebung gestaltet? Welche Rolle spielen die Farben? Was will das Bild aussagen? Analyse der Sprache: Gibt es Fach- oder Fremdwörter? Welche sprachlichen Mittel sind zu erkennen? Welche Besonderheiten im Satzbau liegen vor? Schluss Gesamtanalyse: Was ist die Werbebotschaft? Welche Vorzüge des Produkts / Unternehmens werden betont? Welche Bedürfnisse werden angesprochen / befriedigt? Bewertung: Wie gefällt Ihnen die Anzeige? Wie wirkt die Anzeige auf die angesprochene Zielgruppe? Wirkt die AIDA-Strategie in der Anzeige? Beispielswerbeanlyse Referenz: [[werbeanzeige_kölln-müsli.jpg]]\nIn der vorliegenden Werbeanzeige wird das Knuspermüsli “Schoko \u0026 Keks Kakao” von Kölln beworben. Die Zielgruppe besteht aus Familien, Jugendlichen und Erwachsenen, die Müsli frühstücken.\nIn der Mitte der Werbeanzeige steht eine übergroße Packung des Kölln-Müslis „Knusper Schoko \u0026 Keks Kakao“. Auf der Verpackung sind Hafer-Vollkornflocken, Stücke weißer Schokolade und Kakaokekse abgebildet. Vor der Packung liegt eine große, weiße Schokoladentafel auf dem Boden. Links neben der Müslipackung steht eine Milchflasche. Zwei junge Männer sind rechts von der Müslipackung zu sehen und machen. Der Mann auf der linken Seite hält ein riesiges, längliches Stück weißer Schokolade. Der Mann auf der rechten Seite sitzt hinter einem Schlagzeug und trommelt. Eine große Hängelampe befindet sich über den beiden Männern und wirft das Licht auf die Headline HIER WOLLEN ALLE EINE ZUGABE Der Boden besteht aus Holzleisten. Am unteren Bildrand ist das Kölln-Logo mit dem Slogan „IN DER FAMILIE ZUHAUSE – SEIT1820.“ versehen ist. Die Aufmerksamkeit wird sofort auf die große Müslipackung gelenkt, die fast die gesamte Höhe der Anzeige einnimmt und größer als in der Realität dargestellt wird. Das Produkt wird direkt so präsentiert, wie man es kauft. Die Umgebung ist modern und freundlich; der helle Holzfußboden und die Küchenlampe schaffen eine wohnliche bzw. häusliche Atmosphäre. Die blaue Farbe der Packung spiegelt die Farbe des Logos wider, was den Bezug zum Unternehmen unterstützt. Die Kernaussage der Werbeanzeige wird von der Headline „HIER WOLLEN ALLE EINE ZUGABE!“ unterstützt. Zusammen mit den Musikern wird der Eindruck von etwas Aufregendem, das Freude bereitet und von dem man mehr möchte erweckt, wie nach einem Konzert. Das Wort „Zugabe“ verdeutlicht, dass das Müsli so lecker und knusprig ist, dass man nach einer Portion mehr davon möchte, also eine „Zugabe“ verlangt. Es gibt keine Fach- oder Fremdwörter, die Sprache ist einfach und verständlich. Als sprachliches Mittel wird mit “Knuspern Keks Kakao” eine Alliteration gewählt.\nDas Kölln Müsli “Schoko \u0026 Keks Kakao” ist ein Genussprodukt, das für Freude beim Frühstück sorgt und nach mehr verlangt. Die Vorzüge des Produkts liegen im Geschmack (Schoko und Keks). Es wird das Bedürfnis nach einem süßen und knusprigen Frühstück angesprochen Die Anzeige ist gelungen. Die Anzeige vermittelt eine positive Stimmung (Zugabe durch Musikband, häusliche Atmosphäre) und regt die Zielgruppe zum Kauf des Produkts an."},"title":"Werbeanalyse Kriterien"},"/docs/deutsch/werbung/":{"data":{"":"","#":"Definition: Als Werbung gilt die Verbreitung von Informationen über ein Produkt in der Öffentlichkeit.\nBlickfang Ein visuelles Element in der Werbeanzeige, welches den Blick des Betrachters auf sich zieht.\nSlogan Übertragung der Kernbotschaft in einem kurzen, einprägsamen Satz.\nHeadline Die Überschrift einer Werbeanzeige.\nLogo Eine einzigartige Grafik, wie beispielsweise das Markensymbol.\n![[werbeanzeige_Lindt.png]]\nSprachliche Auffälligkeiten Allgemein - ungewöhnliche Sprache - exotisch - veraltete Sprache - vermittelt Luxus - ausgeschmückt\nSatzbau lange Sätze, mit vielen Nebensätzen Schreibweise hohe Anzahl an Adjektiven Fremdwörter rhetorische Mittel Neologismen Hyperbel Alliteration Wortwahl Fachsprache positive Wortwahl rhetorische Mittel Bezeichnung Definition Beispiel Alliteration Wiederholung der Anfangsbuchstaben in aufeinanderfolgenden Wörtern Wieso, weshalb, warum? Anapher Wiederholung von Wörtern/Wortteilen am Satzanfang Morgen Kinder wird’s was geben. Morgen werden wir uns freun. Antithese Gegenüberstellung entgegengesetzter Begriffe Gut und Böse Euphemismus Verhüllende, beschönigende Umschreibung „mit nassem Blick“ (für „weinend“) Hyperbel Übertreiben über das -normale Maß hinaus Das habe ich dir schon tausend Mal gesagt. Metapher Vergleich ohne „wie“ oder „als“. “Rabeneltern“ (für Eltern, die sich nicht um ihr Kind kümmern) Neologismus Wortneuschöpfung hartzen; Alcopop Personifikation Belebung eines Dinges oder Wortes wie Liebe/\nFreiheit etc. Die Kälte kroch ihm in die Beine. Rhetorische Frage Scheinbare Frage, der Sprecher erwartet jedoch eine bestimmte Antwort Hast du etwa noch nie einen Fehler gemacht? Vergleich Vergleich mit „wie“ oder „als“. Mutig wie ein Löwe stürzte er sich auf den Angreifer. "},"title":"Werbung"},"/docs/it-t/kritischer-pfad/":{"data":{"":"Definition: Der kritische Pfad (auch kritischer Weg genannt) ist die Kette der Vorgänge, bei deren zeitlicher Änderung sich der Endtermin eines Projektes verschiebt. Er wird durch eine Kette von Einzel-Aktivitäten bestimmt, deren Summe aller Pufferzeiten Null ist. Alle anderen Aktivitäten können im Rahmen ihrer Pufferzeit zeitlich verschoben oder verlängert werden, ohne die Gesamtprojektdauer zu verändern."},"title":"Kritischer Pfad"},"/docs/it-t/marktsegmentierung-und-zielgruppen/":{"data":{"":"","#":"Definition: Aufteilung des Marktes in kleiner Teilgebiete/Teilgruppen. Dies ermöglich individuelle Gestaltung des Produktes oder der Kommunikationsstrategie. Es werden hierfür verschiedene Kriterien verwendet werden.\nÜbliche Kriterien Demografisch Alter, Geschlecht Einkommen Bildung Haushaltsgröße Religion Geografisch basierend auf Wohnort (Land/Stadt) Region Tradition Psychografisch Lebensstil Persönlichkeit Aktivitäten Wertvorstellungen Verhaltensbasiert Preisverhalten Mediennutzung Einkaufsstättenwahl Markenwahl Kaufvolumen Treue Gewohnheiten "},"title":"Marktsegmentierung und Zielgruppen"},"/docs/it-t/netzplan/":{"data":{"":"#Diagramm #TODO Definition: Der Netzplan ist die grafische Abbildung von Vorgangsketten. Jede Aktivität kann mehrere Vorgänger und mehrere Nachfolger haben. Es ist dadurch ebenfalls der [[Kritischer Pfad|kritische Pfad]] erkennbar. Meist ist sind die Zeiten in ganzen Tagen angegeben.","table-of-contents#Table of Contents":" [[#Schema|Schema]] [[#Vorgang|Vorgang]] [[#Gesamtpuffer|Gesamtpuffer]] [[#Dauer|Dauer]] [[#Dauer#Zeitpunkte|Zeitpunkte]] [[#Bearbeitung|Bearbeitung]] Schema ![[Netzplan-Schema.png]]\nVorgang Der Vorgang ist eine definierte Aktivität, welche meist mit der [[Netzplan#Dauer|Dauer]] jenes Vorgangs angegeben ist.\nGesamtpuffer Das ist der gesamte Puffer, ist die Zeitspanne, um die ein Vorgang gegenüber seiner geplanten Dauer verschoben werden kann, unter Einhaltung des geplanten Projektendes.\nDauer Die Dauer ist die Länge der Zeit, welche ein [[Netzplan#Vorgang|Vorgang]] beansprucht.\nZeitpunkte In einem Netzplan gibt es folgende Zeitpunkte:\nFrühester Anfangszeitpunkt Spätester Anfangszeitpunkt Frühester Endzeitpunkt Spätester Endzeitpunkt Bearbeitung Aufzeichnung der logischen Abfolge der Vorgänge nach Angabe Vorwärtskalkulation (bei einer Zusammenführung immer mit der höchsten Anzahl an Tagen weiter rechnen) Rückwärtskalkulation (bei einer Zusammenführung immer mit der niedrigsten Anzahl an Tagen weiter rechnen) Gesamtpuffer auswerten (Differenz aus SEZ und SAZ oder SAZ und FAZ) "},"title":"Netzplan"},"/docs/it-t/vertriebsformen/":{"data":{"":"","der-vertrieb#Der Vertrieb":"Der Vertrieb Aufgaben des Vertriebs ([[Beschaffungsprozess]]):\nBepreisung von Produkten Produkte bewerben Kundenberatung Einkauf von Ware Identifizierung potenzieller Kunden \u0026 Kontaktaufnahme Betreuung der Kunden nach dem Kauf -\u003e Pflege von langfristigen Kundenbeziehungen ","vertriebsformen#Vertriebsformen":"Vorteile dieser Vertriebsform durch ‘+’ gekennzeichnet. Nachteile dieser Vertriebsform durch ‘-’ gekennzeichnet.\nDirektvertrieb (Verkauf direkt an Kunden) Direkter Kontakt, schnellere Kundenbindung Hohe Kosten, begrenzter Kundenkreis Indirekter Vertrieb (Verkauf über Dritte1) Größere Reichweite, reduzierte direkte Kosten Weniger Kontrolle, verzerrte Markenbotschaft Strukturvertrieb (Empfehlungsmarketing) Motivation durch Boni, schnelle Umsatzsteigerung Fokus auf kurzfristige Gewinne, hohe Fluktuation Virales Marketing (via Social Media) Weite Verbreitung, kostengünstig Wenig Kontrolle, schwierige Messung des Erfolgs Online-Vertrieb (Verkauf übers Internet) Globale Reichweite, niedrige Betriebskosten, 24/7 Verfügbarkeit Starke Konkurrenz, Sicherheitsbedenken, fehlender persönlicher Kontakt , wie beispielsweise Händler oder Wiederverkäufer ↩︎"},"title":"Vertriebsformen"},"/docs/it/%C3%BCbertragungsarten/":{"data":{"":"","#":"#TODO\nUnicast 1-zu-1 Kommunikation Ziel ist genau ein Host Multicast 1-zu-mehrere Kommunikation Ziel ist eine Gruppe z.B.: alle Router [[IPv4 Netzklassen#Klasse D|Öffentlicher IPv4 Multicast Bereich]]: 224.0.0.0 bis 239.255.255.255 Öffentliche IPv6 Multicast Bereich: ff00:: bis ffff:: Broadcast 1-zu-alle Kommunikation Ziel ist das gesamte Netzwerk Anycast Unicast-Adresse, die mehrfach vergeben wird Nächstgelegenes Gerät erhält das IP-Paket "},"title":"Übertragungsarten"},"/docs/it/arten-von-schadsoftware/":{"data":{"":"Definition: Der Begriff Schadsoftware oder Malware beschreibt Programme, welche entwickelt worden sind, um Schaden anzurichten. Dabei wird meist von ‘Viren’ gesprochen, jedoch sind Schadsoftware in mehrere Arten unterteilt. Weiter ist oft die Rede von ‘Virenschutz’, wobei meist vor allen Arten von Schadsoftware versucht wird zu schützen. Heutzutage reicht ein reiner ‘Virenschutz’ nicht aus und stattdessen wird heutzutage eine ‘Endpoint Protection’ verwendet.\nTrojaner Virus Wurm Phishing Ransomware Beschreibung Bösartige Anwendung, die sich\nals jemand Anderes ausgibt\nund ein System von innen angreift Bösartige Anwendung Bösartige Anwendung Betrugsverfahren Bösartige\nVerschlüsselungssoftware Ziele Öffnung einer Hintertür Zerstörung von Daten und Veränderung des Algorightmus Lahmlegen von Netzwerken\nund Selbstverbereitung Datendiebstahl\n-\u003e Geld Erpressung\n-\u003e Geld Infektion Tarnung als gutartige Software Download Download Download Download Beispiel PC Cleaner MeterPreter Stuxnet Fake Banken WannaCry "},"title":"Arten von Schadsoftware"},"/docs/it/datenbanksystem/":{"data":{"":"","#":"#TODO\nSchema ![[Datenbanksystem-Schema.png]]\nDatenbanksysteme (DBS) DBS ermöglicht die anwendungsübergreifende Nutzung von Daten. DBS isoliert Anwendungen von Hardware und Betriebssystem DBS = DB + DBMS Datenbank (DB) Persistente Speicherung von Daten Zentraler Ansatz (Integrierter Datenbestand) Datendefinition (Datenstruktur, Integritätsregeln) und Zugriff auf die Daten (Operationen) erfolgen nur durch das DBMS Datenbankmanagementsystem (DBMS) DBMS ermöglicht einfache Datendefinition und Zugriff auf die Daten DBMS garantiert Korrektheit der Daten (Einhaltung der Integritätsregeln) DBMS garantiert Korrektheit der Daten im Mehrbenutzerbetrieb (Concurrency Control) DBMS garantiert Datensicherheit z.B.: Korrektheit bei fehlerhaften Abläufen oder Systemabstürzen DBMS bietet Mechanismen zur Zugriffskontrolle (Datenschutz) "},"title":"Datenbanksystem"},"/docs/it/energie-und-leistung/":{"data":{"":"","#":"Definition: Energie und Leistung beschreibt das Leisten von Arbeit und die in einer Zeitspanne umgesetzte Energie.\nGrundgrößen [^1]Spannung Definition: Potenzialunterschied zwischen zwei Punkten\nEinheit: V (Volt) Netzspannung in Deutschland: 230V (220-240V) Formelzeichen: U Berechnungsformel: U = R * I [^1]Stromstärke Definition: Elektronen, die durch einen Leiter fließen\nEinheit: A (Ampere) Formelzeichen: I Berechnungsformel: I = U / R [^1]Leistung Definition: Die in einer Zeitspanne umgesetzte Energie\nEinheit: W (Watt) Formelzeichen: P Berechnungsformel: P = U * I [^1]Wiederstand Definition: Die Hemmung des Stromes in einem Leiter\nEinheit: Ω (Ohm) Formelzeichen: R (Resistance) Berechnungsformel: R = U * I [^1]Ladung Einheit: As (Ampere Sekunde) Formelzeichen: Q Berechnungsformel: Q = I * t [^1]Wirkungsgrad Definition: Das Verhältnis von abgeführter Leistung zu zugeführter Leistung\nEinheit: % (Prozent) Formelzeichen: η Berechnungsformel: η (eta) = P$ab$ / P$zu$ [^1]Arbeit/Energie Definition:\nEinheit: Ws Formelzeichen: W (Work) Berechnungsformel: W = P * t Beispielaufgaben Aufgabe 1 Auf einem Drucker sind folgende Werte abgebildet: Betriebsspannung (AC): 110V bis 240V Druckmodus: / = 1,45 A Sleep-Modus: / = 2,5 mA\na) Berechnen Sie die Leistungsaufnahme während eines Druckvorgangs.\nGeg.: U = 230V, I = 1,45A Ges.: P benötigte Formel(n): U * I = P\n230 * 1,45 = 333,50W A: Während des Druckvorgangs entsteht eine Leistungsaufnahme von 333,5 Watt.\nb) Berechnen Sie den Jahresenergiebedarf im Sleep-Modus (eines Druckers).\nGeg.: U = 230V, I = 0,0025 Ges.: W/Jahr benötigte Formel(n): U * I = P, P * t = W\n230V * 0,0025A = 0.575W 0,575W * (365 * 24) = 5.037Wh = 5,04kWh/Jahr A: Der Drucker benötigt innerhalb eines Jahres im Sleep-Modus 5,04kWh Energie\nAufgabe 2 Berechnen Sie den Energiebedarf der Monitore (14 * 2) für ein Jahr mit 249 Arbeitstagen (alle anderen Tage werden nicht berücksichtigt): Stromversorgung Eingangsspannung 100 bis 240 VAC Stromverbrauch (im Betrieb) 19 W Stromverbrauch (jährlich) 28 kWh Stromverbrauch (in Standby) 0,23 W Hinweise zum Stromverbrauch Energieverbrauch von 28 kWh basierend auf dem Stromverbrauch der Einheit bei einem Betrieb von 4 Stunden/Tag an 365 Tagen. Der tatsächliche Energieverbrauch hängt von der Verwendung der Einheit ab. Stromverbrauch (ausgeschaltet) 0,17 W\na) für einen Monitor im Standby-Betrieb (16h pro Arbeitstag).\nGeg.: P$standby$ = 0,23 W, tArbeitstag = 16h, tArbeitstage = 249d Ges.: W/Jahr benötigte Formel(n): P$standby$ * tArbeitstag * tArbeitstage = W/Jahr\n0,23W * 16h * 249d = 916,32Wh/Jahr = 0,92kWh/Jahr A: Der Monitor benötigt innerhalb eines Jahres mit 249 Arbeitstagen mit je 16 Stunden standby-Verbrauch 0,92kWh.\nb) für einen Monitor bei betrieblicher Nutzung (8h pro Arbeitstag).\nGeg.: P$Betrieb$ = 0,23 W, tArbeitstag = 8h, tArbeitstage = 249d Ges.: W/Jahr benötigte Formel(n): P$Betrieb$ * tArbeitstag * tArbeitstage = W/Jahr 19W * 8h * 249d = 37.848Wh/Jahr = 37,85kWh/Jahr A: Der Monitor benötigt innerhalb eines Jahres mit 249 Arbeitstagen mit je 8 Stunden Betrieb-Verbrauch 37,85kWh.\nc) für alle (28) Monitore bei kombinierter Nutzung (a+b) (Gesamtenergiebedarf)\nGeg.: Anzahl Montiore = 28, WStandby = 0,92kWh/Jahr, WBetrieb = 37,85kWh/Jahr Ges.: Wgesamt/Jahr benötigte Formel(n): Anzahl Monitore * WStandby * WBetrieb = Whgesamt/Jahr\n28 * (916,32Wh + 37.848Wh) = 1,085,400Wh/Jahr = 1.085,4kWh/Jahr\nAufgabe 6 Die zehn Netzwerkserver sollen mittels USV abgesichert werden. Die Leistung eines Servernetzteils beträgt dabei im Volllastbetrieb 750 W. Die USV beinhaltet 8 Akkus mit einer Ladungsmenge pro Akku von 200 Ah bei einer Spannung von 12 V.\nBei Netzausfall sind die acht Akkus der USV zu 100% geladen. Die Akkus werden vollständig entladen. Verluste sind nicht zu berücksichtigen. Die Berechnung basiert auf Volllastbetrieb. a) Ermitteln Sie die an die USV angeschlossene Leistung.\nGeg.: Anzahl Server = 10, PNetzteil = 750W Ges.: Pgesamt benötigte Formel(n): Pgesamt = PNetzteil * Anzahl Server\nPgesamt = 750W * 10 = 7.500W A: Die gesamte Leistung, welche an die USV angeschlossen ist, sind 7.500W.\nb) Ermitteln Sie die gesamte Ladungsmenge (Kapazität) der acht Akkus.\nGeg.: Qakku = 200Ah, Anzahl Akkus = 8 Stk. Ges.: Qgesamt benötigte Formel(n): Qgesamt = Qakku * Anzahl Akkus\nQgesamt = 200Ah * 8Stk. = 1600Ah A: Die gesamte Kapazität der USV mit 8 Akkus beträgt bei 200Ah je Akku, 1.000Ah.\nc) Ermitteln Sie die elektrische Energie, welche die acht Akkus bei einer Spannung von 12 V insgesamt abgeben können.\nGeg.: Qgesamt = 1.600Ah, Uakku = 12V Ges.: Wgesamt benötigte Formel(n): W = P * t\nWgesamt = 1.600Ah * 12V = 19.200Wh = 19,2kWh\nd) Ermitteln Sie die theoretische Überbrückungszeit der USV in Stunden und Minuten.\nGeg.: Pgesamt = 7.500W, Wgesamt = 19.200Wh Ges.: tüberbrückungszeit benötigte Formel(n): tüberbrückungszeit = Wgesamt / Pgesamt\n19.200Wh / 7.500W = 2,56h = 2h 34m\n[Refferenz]((https://bsffbde-my.sharepoint.com/:b:/g/personal/timmatheis_schueler_bs-ffb_de/Eb7n5ISphIRCnb74v2yuq4QBXKgAydghoFUEo_QtPNo1fg?e=VPFOSj)\nelektrische ↩ "},"title":"Energie und Leistung"},"/docs/it/energie-und-leistung/das-ohmsche-gesetz/":{"data":{"":"","#":"Definition: Das ohmsche Gesetz beschreibt den Zusammenhang zwischen 1[[Energie und Leistung#[ 1]Spannung|Spannung]] (U), 1[[Energie und Leistung#[ 1]Stromstärke|Stromstärke]] (I) und 1[[Energie und Leistung#[ 1]Wiederstand|Wiederstand]] (R) in einem elektrischen Leiter. Es lautet: U = R × I -\u003e Das bedeutet, dass die Spannung gleich dem Produkt aus Widerstand und Stromstärke ist.\nDie URI-Pyramide Mit folgender Pyramide können folgende elektrischen Größen berechnet werden: 1[[Energie und Leistung#[ 1]Spannung|Spannung]], 1[[Energie und Leistung#[ 1]Wiederstand|Wiederstand]], 1[[Energie und Leistung#[ 1]Stromstärke|Stromstärke]] ![[URI_Pyramide.png]]\nDiese ermöglicht diese Berechnungen durch Umstellen der Gleichung. Dabei ist die Position der Größen essenziell. Es muss stets von oben nach unten gerechnet werden. Umstellmöglichkeiten:\nSpannung: U = R * I Wiederstand: R = U / I Stromstärke: I = U / R elektrische ↩︎ ↩︎ ↩︎ ↩︎ ↩︎ ↩︎"},"title":"Das ohmsche Gesetz"},"/docs/it/generationenprinzip/":{"data":{"":"","#":"Definition: Das Generationenprinzip (auch Großvater-Vater-Sohn-Prinzip genannt) ist eine Datensicherungsstrategie. Dabei stellt dieses sicher, dass immer mehrere Sicherungen in verschiedenen zeitlichen Abstufungen vorhanden sind. Dabei ist es nicht an einen speziellen Sicherungstyp (vollständig, differenziell, inkrementell) gebunden.\nBeispiel An jedem Arbeitstag wird ein Backup erstellt. Dies ist das Sohn-Backup. Jede Woche wird ein Backup erstellt. Dies ist das Vater-Backup. Jeden Monat wird ein Backup erstellt. Dies ist das Großvater-Backup. "},"title":"Generationenprinzip"},"/docs/it/iso-osi-referenzmodell/":{"data":{"":"Definition: Das ISO/OSI Referenzmodell (Open Systems Interconnection model) ist ein Model für Netzwerkprotokolle als Schichten und wurde durch die ISO (International Organization for Standardization) als Standard veröffentlicht. Dieses Modell beinhaltet sieben Schichten und ermöglicht die Einordnung von Netzwerkprotokollen in diese Schichten. Im Bereich der Ausbildung zum Fachinformatiker für Systemintegration werden meist die Schichten 5 - 7 seltener in ihrer Einzelheit benötigt.","table-of-contents#Table of Contents":" [[#OSI-Modell|OSI-Modell]] [[#Merksätze für das ISO/OSI-Modell|Merksätze für das ISO/OSI-Modell]] [[#Einordnung in Schichten|Einordnung in Schichten]] OSI-Modell OSI-Schicht OSI-Schicht TCP/IP-Referenzmodell Protokollbeispiele [[Protocol data unit (PDU)|PDU]] Kopplungselemente 7 [[Schicht 5 - 7 (Layer 5 - 7)#Schicht 7 - Anwendungsschicht (Application layer)|Anwendungsschicht (Application layer)]] Anwendung DHCP DNS FTP HTTP HTTPS LDAP [[MQTT]]\nNCP RTP SMTP XMPP Nutzdaten Gateway, Content-Switch, Proxy 6 [[Schicht 5 - 7 (Layer 5 - 7)#Schicht 6 - Darstellungsschicht (Presentation layer)|Darstellungsschicht (Presentation layer)]] Anwendung Nutzdaten 5 [[Schicht 5 - 7 (Layer 5 - 7)#Schicht 5 - Sitzungsschicht (Session layer)|Sitzungsschicht (Session layer)]] Anwendung Nutzdaten 4 [[Schicht 4 - Transportschicht (Transport layer)|Transportschicht (Transport layer)]] Transport TCP UDP SCTP SPX TCP Segmente UDP Datagramme 3 [[Schicht 3 - Vermittlungsschicht (Network layer)|Vermittlungsschicht (Network layer)]] Internet ICMP IGMP [[Internet Protocol]]\nIPsec IPX Pakete Router, Layer-3-Switch 2 [[Schicht 2 - Sicherungsschicht (Data link layer)|Sicherungsschicht (Data Link layer)]] Netzzugriff IEEE 802.3 EthernetIEEE 802.11 WLAN\nTLAP FDDI MAC Token Ring ARCNET Frames Bridge, Switch, Access Point 1 [[Schicht 1 - Bitübertragungsschicht (Pysical layer)|Bitübertragungsschicht (Physical layer)]] Netzzugriff 1000BASE-T Token Ring ARCNET Bits, Symbole Netzwerkkabel, Repeater, Hub Merksätze für das ISO/OSI-Modell Zum Merken der Schichten des ISO/OSI-Modells auf englisch bietet sich folgender Satz an: Please Do Not Throw Salami Pizza Away. Der Anfangsbuchstabe jedes Wortes in diesem Satz ist der Anfangsbuchstabe für die Schicht auf englisch. Beginnend mit Schicht 1 arbeitet sich dieser Satz nach oben.\nZum Merken der Schichten des ISO/OSI-Modells auf deutsch bietet sich folgender Satz an: Alle deutschen Studenten trinken verschiedene Sorten Bier. Der Anfangsbuchstabe jedes Wortes in diesem Satz ist der Anfangsbuchstabe für die Schicht auf deutsch. Beginnend mit Schicht 7 arbeitet sich dieser Satz nach unten.\nEinordnung in Schichten Im ISO/OSI Modell scheint eine Einordnung von Protokollen zuerst recht trivial, jedoch sank die Möglichkeit eindeutiger Einordnung in eine Schicht über die Jahre seit der Einführung dieses Modells. Durch die verbreitete Verwendung von NGFWs, APs, mit DHCP-Fähigkeiten und Router mit eingebautem Access Point, ist eine Einordnung nur noch aufgrund des Hauptverwendungszwecks möglich."},"title":"ISO-OSI Referenzmodell"},"/docs/it/iso-osi-referenzmodell/schicht-1---bit%C3%BCbertragungsschicht-pysical-layer/":{"data":{"":"","#":"Definition: Die Bitübertragungsschicht ist die unterste Schicht des [[_ISO-OSI Referenzmodell|ISO-OSI Referenzmodell]]. Auf dieser Schicht befinden sich physische Verbindungen und die Übertragung von Bits über diese.\nHardware Die Hardware auf dieser Schicht sind rudimentäre physische Verbindungen, wie Repeater, Hubs, Leitungen(z.B.: LWL, Kupfer), Stecker (z.B.: RJ45, SC/APC) und weitere.\nÜbertragungsart Die Signalübertragung findet über modulierte, hochfrequente, elektromagnetische Wellen oder Lichtimpulsen auf einer oder mehrerer Wellenlängen auf obiger Hardware statt.\nProtokolle 1000BASE-T Token Ring ARCNET "},"title":"Schicht 1 - Bitübertragungsschicht (Pysical layer)"},"/docs/it/iso-osi-referenzmodell/schicht-2---sicherungsschicht-data-link-layer/":{"data":{"":"","#":"Definition: Die Sicherungsschicht ist die zweite Schicht des [[_ISO-OSI Referenzmodell|ISO-OSI Referenzmodell]]. Aufgabe dieser Schicht ist, eine möglichst fehlerfreie Übertragung von Daten in einem Netzwerk zu ermöglichen und Zugriff auf das Übertragungsmedium zu regeln. Auf dieser Schicht findet eine Punkt-zu-Punkt Verbindung statt.\nHardware Auf dieser Schicht befindet sich folgende Hardware:\nBridge Switch Access Point Übertragungsart Bei der Übertragung werden Bitdatenströme, welche auf den oberen Schichten generiert wurden, in einzelne Blöcke (sogenannte Frames) aufgeteilt. Um mögliche Übertragungsfehler zu erkennen, werden zusätzlich an Prüfsummen zu den Frames angehängt, welche der Empfänger prüfen und im Fehlerfall den Frame verwerfen oder korrigieren kann.\nProtokolle IEEE 802.3 Ethernet IEEE 802.11 WLAN TLAP FDDI MAC PDU Das [[Protocol data unit (PDU)]] auf dieser Schicht nennt sich Frames. Bei einem untagged Ethernet 2 Frame wird dabei an den Datensatz ein Header vorne angebaut und einen Trailer mit der Frame Check Sum (FCS) anhängt. Im Header befinden sich unter anderem in Reihenfolge links nach rechts zuerst die Destination (Ziel-)MAC-Adresse, die Source (Quell-)MAC-Adresse und das Typenfeld, sowie weitere Verwaltungsinformationen."},"title":"Schicht 2 - Sicherungsschicht (Data link layer)"},"/docs/it/iso-osi-referenzmodell/schicht-3---vermittlungsschicht-network-layer/":{"data":{"":"","#":"Definition: Die Vermittlungsschicht ist die dritte Schicht des [[_ISO-OSI Referenzmodell|ISO-OSI Referenzmodell]]. Aufgabe dieser Schicht ist, Daten in und durch andere Netzwerke zu bewegen mittels netzwerkübergreifender Adressen, sowie Routing. Auf dieser Schicht findet eine physische Ende-zu-Ende Verbindung statt.\nHardware Auf dieser Schicht befindet sich folgende Hardware:\nRouter [Layer-3-Switch](https://de.wikipedia.org/wiki/Layer-3-Switch|Layer 3 Switch) Protokolle ICMP IGMP [[Internet Protocol|IP]] IPsec IPX PDU Das [[Protocol data unit (PDU)]] auf dieser Schicht nennt sich Paket. Bei einem IPv4-Paket wird dabei an den Datensatz ein Header mit einer Länge von minimal 20 Bytes angebaut. In diesem befinden sich unter anderem in Reihenfolge links nach rechts zuerst die Source (Quell-)IPv4-Adresse, die Destination (Ziel-)IPv4-Adresse und das Typenfeld, sowie weitere Verwaltungsinformationen."},"title":"Schicht 3 - Vermittlungsschicht (Network layer)"},"/docs/it/iso-osi-referenzmodell/schicht-4---transportschicht-transport-layer/":{"data":{"":"","#":"Definition: Die Transportschicht ist die vierte Schicht des [[_ISO-OSI Referenzmodell|ISO-OSI Referenzmodell]]. Auf dieser Schicht findet eine logische Ende-zu-Ende Verbindung statt. Aufgabe dieser Schicht ist die qualitätssichernde Übertragung von Datensätzen variabler Länge zwischen zwei Geräten über Netzwerke hinaus. Die Protokolle dieser Schicht sind entweder Verbindungsorientiert oder Verbindungslos.\nHardware Auf dieser Schicht befindet sich folgende Hardware:\nNGFW Hardware Load Balancer Protokolle TCP (Transmission Control Protocol) UDP (User Datagram Protocol) SCTP SPX PDU Das [[Protocol data unit (PDU)]] auf dieser Schicht nennt sich UDP-Datagram oder TCP-Segment basierend auf dem verwendeten Protokoll. Bei einem 1 wird dabei an den Datensatz ein Header mit einer Länge von minimal 20 Bytes und maximal 60 Bytes angebaut. In diesem Header befinden sich Verwaltungsinformationen, wie unteranderem die Source- und Destination Portnummer."},"title":"Schicht 4 - Transportschicht (Transport layer)"},"/docs/it/iso-osi-referenzmodell/schicht-5---7-layer-5---7/":{"data":{"":"Definition: Die Schichten 5 bis 7 sind Schichten des [[_ISO-OSI Referenzmodell|ISO-OSI Referenzmodell]]. Diese Schichten sind im Gegensatz zu den darunterliegenden Schichten schwierig passend aufzuteilen. Auf diesen Schichten werden Sitzungen verwaltet, Daten verschlüsselt, Daten komprimiert und Funktionen für die Anwendungen.","table-of-contents#Table of Contents":" [[#Gemeinsamkeiten|Gemeinsamkeiten]] [[#Gemeinsamkeiten#Hardware|Hardware]] [[#Gemeinsamkeiten#PDU|PDU]] [[#Gemeinsamkeiten#Protokolle|Protokolle]] [[#Schicht 5 - Sitzungsschicht (Session layer)|Schicht 5 - Sitzungsschicht (Session layer)]] [[#Schicht 6 - Darstellungsschicht (Presentation layer)|Schicht 6 - Darstellungsschicht (Presentation layer)]] [[#Schicht 7 - Anwendungsschicht (Application layer)|Schicht 7 - Anwendungsschicht (Application layer)]] Gemeinsamkeiten Hardware Auf dieser Schicht befindet sich folgende Hardware:\nNGFW Web Application Firewall (WAF) Application Delivery Controller (ADC) PDU Auf den Schichten gibt es noch kein spezielles [[Protocol data unit (PDU)]]. Auf den Schichten 5 - 7 werden Datensätze Nutzdaten genannt. Diese werden von diesen Schichten produziert und werden von unteren Schichten gekapselt.\nProtokolle Auf diesen Schichten arbeiten folgende Protokolle:\nDHCP DNS FTP HTTP HTTPS LDAP [[MQTT]] NCP RTP SMTP XMPP Schicht 5 - Sitzungsschicht (Session layer) Die Sitzungsschicht ist die fünfte Schicht des [[_ISO-OSI Referenzmodell|ISO-OSI Referenzmodell]]. Die Aufgaben dieser Schicht sind der Aufbau von Verbindungen, die Verwaltung laufender Verbindungen und der Abbau von Verbindungen zwischen zwei oder mehr Clients.\nSchicht 6 - Darstellungsschicht (Presentation layer) Die Darstellungsschicht ist die sechste Schicht des [[_ISO-OSI Referenzmodell|ISO-OSI Referenzmodell]]. Die Aufgabe dieser Schicht ist die Formatierung von Daten und Übersetzung in ein durch die [[Schicht 5 - 7 (Layer 5 - 7)#Schicht 7 - Anwendungsschicht (Application layer)|Anwendungsschicht]] vorgegebenes Format.\nSchicht 7 - Anwendungsschicht (Application layer) Die Anwendungsschicht ist die siebte Schicht des [[_ISO-OSI Referenzmodell|ISO-OSI Referenzmodell]]. Diese ist die Schicht, welche am nächsten am Nutzer ist. Die Aufgabe dieser Schicht ist die Bereitstellung von Netzwerkzugriff für Anwendungen und die Benutzerauthentifizierung und Autorisierung.\nNote\nAnwendungen, wie File Explorer und Microsoft Word gehören nicht zur [[Schicht 5 - 7 (Layer 5 - 7)#Schicht 7 - Anwendungsschicht (Application layer)|Anwendungsschicht]], jedoch Browser und E-Mail-Programme schon."},"title":"Schicht 5 - 7 (Layer 5 - 7)"},"/docs/it/it-schutzziele/":{"data":{"":"","#":"#TODO Definition: Die IT-Schutzziele sind ein Konzept der IT, welches die Basis zum Schutz von Daten und Informationswerten bildet. Dieses basiert auf [[Sicherheitsprinzipien|den drei Hauptelementen]] Elementen Vertraulichkeit, Integrität und Verfügbarkeit. Um einen effektiven Schutz zu haben, ist es nötig, dass alle Ziele ergriffen werden.\nKategorien [[Sicherheitsprinzipien]] [[Informationszustände]] [[Sicherheitsprinzipien]] "},"title":"IT Schutzziele"},"/docs/it/it-schutzziele/gegenma%C3%9Fnahmen/":{"data":{"":"","#":"Definition: Diese Kategorie der [[_IT Schutzziele|IT Schutzziele]] beinhaltet, welche Maßnahmen ergriffen werden sollen, um einen umfassenden und effektiven Schutz zu bieten. Diese verbinden technische Vorkehrungen mit organisatorischen Strategien und der Sensibilisierung der Benutzer.\nTechnologien, Geräte, Produkte zur Abwehr/Absicherung Definition Moderne Hardware und spezialisierte Sicherheitsprodukte bieten Schutz gegenüber Angriffen.\nMethoden Firewalls und IDS/IPS: Erkennung und Blockierung unbefugter Zugriffe. VPNs: Schutz der Datenübertragung. Anti-Malware-Lösungen: Verhinderung der Ausführung schädlicher Software. Richtlinien, Verfahren, Leitlinien etablieren Definition Es müssen feste Richtlinien und Verfahren definiert werden, um den Schutz zu regeln.\nMethoden Zugriffs- und Berechtigungskonzepte: Festlegung, wer welche Daten nutzen darf. Sicherheitsprozesse: Regelmäßige Überprüfung und Aktualisierung der Sicherheitsmaßnahmen. Notfallpläne: Vorgehensweisen für den Fall eines Sicherheitsvorfalls. Einstellung der Benutzer Definition Die Benutzer müssen auf Angriffe sensibilisiert werden.\nMethoden Schulungen: Regelmäßige Trainings zu aktuellen Bedrohungen. Simulierte Angriffe: Übungsszenarien wie Phishing-Test "},"title":"Gegenmaßnahmen"},"/docs/it/it-schutzziele/informationszust%C3%A4nde/":{"data":{"":"Definition: Diese Kategorie der [[_IT Schutzziele|IT Schutzziele]] beinhaltet die Element, welche zur Absicherung von Daten in allen Zuständen sorgen.","table-of-contents#Table of Contents":" [[#Übertragung|Übertragung]] [[#Übertragung:#Definition|Definition]] [[#Übertragung:#Methoden|Methoden]] [[#Speicherung|Speicherung]] [[#Speicherung:#Definition|Definition]] [[#Speicherung:#Methoden|Methoden]] [[#Verarbeitung|Verarbeitung]] [[#Verarbeitung:#Definition|Definition]] [[#Verarbeitung:#Methoden|Methoden]] Übertragung Definition Bei der Übertragung müssen Daten und Systeme während des Datenaustauschs vor unbefugtem Zugriff sowie Manipulation geschützt werden.\nMethoden Transportverschlüsselung: Einsatz von Verschlüsselungsprotokollen Authentifizierung der Kommunikationspartner: Sicherstellung, dass nur berechtigte Systeme miteinander kommunizieren Speicherung Definition Bei der Speicherung von Daten ist sicherzustellen, dass diese dauerhaft vor unbefugtem Zugriff, Verlust oder Manipulation geschützt sind.\nMethoden Datenverschlüsselung: Verschlüsselung der Daten im Ruhezustand Zugriffskontrolle: Regulation des Zugriffs auf Speicherbereiche Redundanz: Einsatz von redundanten Speichersystemen Verarbeitung Definition Bei der Verarbeitung von Daten müssen diese vor unbefugtem Eingriff oder Manipulation geschützt werden.\nMethoden Auditierung und Logging: Protokollierung von Zugriffen und Änderungen zur Nachvollziehbarkeit Zugriffskontrolle: Definition und Durchsetzung von Berechtigungen für den Datenzugriff Prozessisolation: Trennung von Anwendungen und Prozessen "},"title":"Informationszustände"},"/docs/it/it-schutzziele/sicherheitsprinzipien/":{"data":{"":"Definition: Diese Kategorie der [[_IT Schutzziele|IT Schutzziele]] beinhaltet die wichtigsten Elemente. Diese benennen Ziele zum Schutz der Cyberwelt.","table-of-contents#Table of Contents":" [[#Vertraulichkeit/Confidentiality|Vertraulichkeit/Confidentiality]] [[#Vertraulichkeit/Confidentiality:#Definition|Definition]] [[#Vertraulichkeit/Confidentiality:#Methoden|Methoden]] [[#Integrität/Integrity|Integrität/Integrity]] [[#Integrität/Integrity:#Definition|Definition]] [[#Integrität/Integrity:#Methoden|Methoden]] [[#Verfügbarkeit/Availability|Verfügbarkeit/Availability]] [[#Verfügbarkeit/Availability:#Definition|Definition]] [[#Verfügbarkeit/Availability:#Methoden|Methoden]] [[#Merkhilfe|Merkhilfe]] Vertraulichkeit/Confidentiality: Definition Die Daten und Systeme dürfen nur für berechtigte Personen, Ressourcen und Prozessen zugänglich sein. Dabei ist Vertraulichkeit mit Datenschutz gleichzusetzen.\nMethoden Datenverschlüsselung: Lesbarkeit von Daten nur von autorisierte Parteien Authentifizierung: Überprüfung der Identität eines Benutzers Zugriffskontrolle: Entscheidung, ob auf eine Ressource zugegriffen werden darf Integrität/Integrity: Definition Die Daten dürfen nicht manipuliert worden sein. Unbefugte oder unbeabsichtigte Änderungen von Daten erkennen kann.\nMethoden Hashing: Erstellung eines Fingerabdrucks von Daten, um Veränderungen festzustellen Versionskontrolle: Protokollierung und Verwaltung von Änderungen an Daten und Systemen Prüfsummen: Berechnung einer Prüfsumme um Integrität zu prüfen Verfügbarkeit/Availability: Definition Die Systeme und Daten müssen stets verfügbar und nutzbar sein. Dies bedeutet, dass IT-Ressourcen, Anwendungen und Services zuverlässig und zeitnah bereitgestellt werden, damit Prozesse reibungslos ablaufen. Dabei ist Integrität mit Qualität gleichzusetzen.\nMethoden Redundanz: Einsatz zusätzlicher Hardware und Systeme, um Ausfälle einzelner Komponenten abfangen zu können. Überwachung und Alarmierung: Überwachung der Systemleistung und frühzeitige Benachrichtigung bei Störungen für schnelle Reaktion. Notfallwiederherstellungspläne (Disaster Recovery): Definierte Verfahren und Maßnahmen zur zeitnahen Wiederherstellung der IT-Infrastruktur im Krisenfall. Merkhilfe Um sich diese wichtigen Ziele besser merken zu können, gibt es als Eselbrücke für die deutschen Begriffe das Wort ‘VIV’ und für die englischen Begriffe das Wort ‘CIA’, wobei jeder Buchtstabe im Wort der Anfangsbuchstabe des Wortes eines Elements der IT-Schutzziele bildet."},"title":"Sicherheitsprinzipien"},"/docs/it/linux/befehle/find/":{"data":{"":"","#":"TL:DR Page MAN Page search for files in a directory hierarchy\nDefinition: Der grep Befehl gibt alles aus, was auf das eingegebene Pattern zutrifft. Im Pattern dürfen Jokerzeichen verwendet werden.\nAufbau find OPTION FILE PATTERNS\nHäufige Exklusionen -name Legt das zu verwendende Pattern fest. -size Legt die grösse von passenden Dateien durch nachfolgende Angabe mit operand (+ = mehr als, - = weniger als) Zahl und Einheit (M = Mebibyte, G = Gibibyte) fest. (Beispiel: -size +10M) -user Legt den User fest, dem passende Dateien gehören müssen. (Beispiel: -user tim)\nBeispiele: root@pop-os:/home/tim# find /home -name *sef* /home/pi/etc-pihole/list.116.blocklist.sefinek.net.domains /home/pi/etc-pihole/list.135.blocklist.sefinek.net.domains /home/pi/etc-pihole/list.61.blocklist.sefinek.net.domains.sha1 /home/pi/etc-pihole/list.84.blocklist.sefinek.net.domains.sha1 [...] root@pop-os:/home/tim# find /home -user pi -name *sef* root@pop-os:/home/tim# find /home -size +1k -name *sef* /home/pi/etc-pihole/list.116.blocklist.sefinek.net.domains /home/pi/etc-pihole/list.135.blocklist.sefinek.net.domains /home/pi/etc-pihole/list.70.blocklist.sefinek.net.domains /home/pi/etc-pihole/list.88.blocklist.sefinek.net.domains [...] Alternativen für den find Befehl: [[grep]] - print lines that match patterns"},"title":"find"},"/docs/it/linux/befehle/grep/":{"data":{"":"","#":"TL:DR Page MAN Page print lines that match patterns\nDefinition: Der grep Befehl gibt alles aus, was auf das eingegebene Pattern zutrifft. Im Pattern dürfen Jokerzeichen verwendet werden.\nAufbau grep OPTION PATTERNS FILE\nHäufige Optionen **-R, *–dereference-recursive Liest alle Dateien in allen Unterverzeichnissen. Folgt allen symlinks. -r, –recursive Liest alle Dateien in allen Unterverzeichnissen.\nBeispiele: root@pop-os:/home/tim# grep -R tim /etc /etc/passwd:tim:x:1001:1001:Tim User,,,:/home/tim:/bin/bash /etc/group:tim:1001: /etc/shadow:tim:$6$xxxxxxxxxxxxxxxx$yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy:18965:0:99999:7::: /etc/sudoers:#includedir /etc/sudoers.d /etc/security/access.conf:# Uncomment and edit the following lines to set up login access control based on time ranges. /etc/fonts/conf.d/65-khmer-fonts.conf: \u003c!-- KhmerOS content tim 1.0 - Regular --\u003e /etc/systemd/system/mytimer.service:[Timer] /etc/systemd/system/mytimer.timer:[Timer] Alternativen für den grep Befehl: [[find]] - search for files in a directory hierarchy"},"title":"grep"},"/docs/it/linux/befehle/locate/":{"data":{"":"","#":"TL:DR Page MAN Page Find filenames quickly.\nDefinition: Der locate Befehl listet alle Dateien oder Verzeichnisse des gesamten Systems auf, die irgendwo die Eingabe nach diesem Befehl im Namen haben.\nDie hierfür verwendete Datenbank /var/lib/mlocate kann mit dem Befehl updatedb aktualisiert/aktualisiert werden.\nHäufige Optionen -c, –count Ausgabe der Anzahl der gefunden Treffer\nBeispiele: root@pop-os:/home/tim# locate firefox /etc/firefox /etc/firefox/pref /etc/firefox/syspref.js /usr/lib/firefox-addons/searchplugins/amazondotorg.xml /usr/lib/firefox-addons/searchplugins/bing.xml /usr/lib/firefox-addons/searchplugins/duckduckgo.xml /usr/lib/firefox-addons/searchplugins/ecosia.xml /usr/lib/firefox-addons/searchplugins/googledotcom.xml /usr/lib/firefox-addons/searchplugins/startpage.xml /usr/lib/firefox-addons/searchplugins/wikipedia.xml /usr/lib/firefox/firefox /usr/lib/firefox/firefox.real /usr/share/applications/firefox.desktop /usr/share/doc/firefox /usr/share/icons/hicolor/16x16/apps/firefox.png /usr/share/icons/hicolor/24x24/apps/firefox.png /usr/share/icons/hicolor/256x256/apps/firefox.png /usr/share/icons/hicolor/32x32/apps/firefox.png /usr/share/icons/hicolor/48x48/apps/firefox.png /usr/share/icons/hicolor/512x512/apps/firefox.png /usr/share/icons/hicolor/scalable/apps/firefox.svg /usr/share/man/man1/firefox.1.gz /usr/share/pixmaps/firefox.png /var/lib/snapd/desktop/applications/firefox_firefox.desktop /var/lib/snapd/icons/160_firefox.png /var/lib/snapd/icons/48_firefox.png /var/lib/snapd/icons/64_firefox.png /var/snap/firefox /var/snap/firefox/common/.mozilla/firefox /opt/firefox root@pop-os:/home/tim# locate firefox -c 30 Ähnliche Befehle für den locate Befehl: [[whereis]] - Locate the binary, source, and manual page files for a command."},"title":"locate"},"/docs/it/linux/befehle/ls/":{"data":{"":"","#":"TL:DR Page MAN Page list directory contents\nDefinition: Der ls Befehl listet alle nicht-versteckten Dateien und Ordner in dem Verzeichnis auf, in welchem dieser ausgeführt worden ist.\nSteht für: list short\nHäufige Optionen -a, –all Zeigt auch Dateien an, welche mit ., .. oder als Attribut hidden haben -l listet mehr Informationen zu den jeweiligen Dateien auf\nBeispiele: root@pop-os:/home/tim# ls file1.txt directory1 image.png script.sh root@pop-os:/home/tim# ls -l -rw-r--r-- 1 user group 1024 Jan 1 10:00 file1.txt drwxr-xr-x 2 user group 4096 Jan 1 10:00 directory1 -rw-r--r-- 1 user group 2048 Jan 1 10:00 image.png -rwxr-xr-x 1 user group 3072 Jan 1 10:00 script.sh root@pop-os:/home/tim# ls -la drwxr-xr-x 5 user group 4096 Oct 26 10:30 . drwxr-xr-x 23 user group 4096 Oct 26 09:55 .. -rw------- 1 user group 1024 Oct 25 16:00 .hidden_file -rw-r--r-- 1 user group 256 Oct 24 14:20 file1.txt drwxr-xr-x 2 user group 4096 Oct 23 11:15 directory1 -rw-r--r-- 1 user group 2048 Oct 22 08:00 image.png -rwxr-xr-x 1 user group 3072 Oct 21 17:45 script.sh Alternativen für den ls Befehl: lsd - The next gen ls command. exa - A modern replacement for ‘ls’."},"title":"ls"},"/docs/it/linux/befehle/pwd/":{"data":{"":"","#":"TL:DR Page MAN Page print name of current/working directory\nDefinition: Der pwd-Befehl gibt den absoluten Pfad aus, aus welchem der Befehl abgesetzt worden ist. Steht für: Print Working Directory\nBeispiel: root@pop-os:/home/tim# pwd /home/tim "},"title":"pwd"},"/docs/it/linux/befehle/whereis/":{"data":{"":"","#":"TL:DR Page MAN Page Locate the binary, source, and manual page files for a command.\nDefinition: Der whereis Befehl durchsucht alle Standardpfade (ausführbare Dateien, Dokumentationen, Konfigurationsdateien) nach Dateien welche irgendwo den Namen der Eingabe haben.\nHäufige Optionen -m Sucht nach MAN pages zu dem angeforderten Befehl -b Sucht nach den Binärdateien zu dem angeforderten Befehl\nBeispiele: root@pop-os:/home/tim# whereis firefox firefox: /usr/bin/firefox /etc/firefox /usr/lib/firefox /usr/share/firefox /usr/share/man/man1/firefox.1.gz root@pop-os:/home/tim# whereis firefox -m firefox: /usr/bin/firefox /usr/share/man/man1/firefox.1.gz Ähnliche Befehle für den whereis Befehl: [[locate]] - Find filenames quickly."},"title":"whereis"},"/docs/it/netzwerkprotokolle/iot/":{"data":{"":" IoT Protokolle [[Bluetooth LE]] [[DECT ULE]] [[LoRa]] [[Matter]] [[MQTT]] [[OPC UA]] offener Standard ❌ ❌ ❌ ✅ ✅ ❌ Reichweite ❌ ✅ ✅ ❌ ❌ ✅ Verschlüsselung ❌ ✅ ✅ ✅ ❌ ✅ Benutzerfreundlich ✅ ✅ ✅ ❌ ❌ ✅ Lightweight ✅ ✅ ✅ ✅ ✅ ✅ Bandbreite ✅ ❌ ❌ ❌ ❌ ❌ Energieverbrauch ✅ ✅ ✅ ❌ ❌ ❌ "},"title":"IoT"},"/docs/it/netzwerkprotokolle/iot/bluetooth-le/":{"data":{"":"","#":"Definition: Das Bluetooth LE (auch Bluetooth Smart genannt) Netzwerkprotokoll ist die stromsparende Variante von Bluetooth und wird für IoT-Anwendungen verwendet.\nStandard Bluetooth LE war in IEEE802.15.1 genormt, wird aber nicht mehr verwendet.\nÜbertragungsmedium Übertragen wird dabei über ein Funkband im 2,4 GHz Bereich\nVorteile Niedriger Energieverbrauch (zwischen 0,01W und 0,5W1) Schneller Verbindungsaufbau Geringe Latenz Nachteile Niedrige Datenrate (max. 1 Mbit/s) Zertifizierungskosten Sicherheitsrisiken abhängig von der verwendeten Übertragungsbandbreite ↩︎"},"title":"Bluetooth LE"},"/docs/it/netzwerkprotokolle/iot/dect-ule/":{"data":{"":"","#":"Definition: Das DECT ULE (Digital Enhanced Cordless Telecommunications Ultra Low Energy) Netzwerkprotokoll ist eine Funktechnologie und wird für IoT-Anwendungen verwendet. Es basiert auf dem DECT-Standard und wurde spezielle für die Anwendung in IoT Geräten entwickelt.\nStandard [TODO]\nÜbertragungsmedium Übertragen wird dabei über ein Funkband im 2,4 GHz Bereich\nVorteile Verschlüsselte Kommunikation Hohe Reichweite Geringe Störungsanfälligkeit (durch reserviertes Frequenzband) Nachteile Nicht weit verbreitet im IoT Hohe Abhängigkeit des Herstellers "},"title":"DECT ULE"},"/docs/it/netzwerkprotokolle/iot/lora/":{"data":{"":"","#":"Definition: Das proprietär LoRa Netzwerkprotokoll ist eine Funktechnologie und wird für IoT-Anwendungen verwendet. Diese basiert auf der Chirp Spread Spectrum (CSS)-Modulation.\nStandard LoRaWAN (Long Range Wide Area Network), spezifiziert von der LoRa Alliance.\nÜbertragungsmedium Übertragung über Funktechnologie mit Frequenzen im Sub-GHz-Bereich (meist 868 MHz)\nVorteile sehr hohe Reichweite (bis zu 10 km) geringer Energieverbrauch gute Gebäudedurchdringung Verschlüsselte Kommunikation Nachteile geringe Datenrate lizenzierte Gateways für öffentliche Netzwerke benötigt begrenzte Anzahl an gleichzeitige Verbindungen je Gateway "},"title":"LoRa"},"/docs/it/netzwerkprotokolle/iot/matter/":{"data":{"":"","#":"Definition: Das offene Matter Netzwerkprotokoll (ehemals Project CHIP - Connected Home over IP genannt) ist eine Funktechnologie und wird für IoT-Anwendungen verwendet.\nStandard Es ist ein offener Standard, der von der Connectivity Standards Alliance (CSA) entwickelt wurde.\nÜbertragungsmedium Nutzt bestehende Protokolle, wie WLAN, Ethernet, Thread und [[Bluetooth LE]] (BLE) für die Kommunikation.\nVorteile Geräte verschiedener Hersteller arbeiten nahtlos zusammen. Verschlüsselte Kommunikation Einfache Einrichtung über QR-Codes oder NFC. Unterstützung durch viele große Tech-Unternehmen unterstützt. Nachteile Wenige Unterstützung von Geräten, da relativ neu. "},"title":"Matter"},"/docs/it/netzwerkprotokolle/iot/mqtt/":{"data":{"":"","#":"#TODO Definition: Das MQTT (Message Queuing Telemetry Transport) IoT-Netzwerkprotokoll ist eine Funktechnologie zur Machine-to-Machine-Kommunikation und wird für IoT-Anwendungen verwendet.\nStandard ISO/IEC 20922:2016\nÜbertragungsmedium Nutzt bestehende Protokolle, wie WLAN, Ethernet, Mobilfunk, [[Bluetooth LE]] und [[LoRa#Standard|LoRaWAN]] für die Kommunikation.\nVorteile Geringer Bandbreitennutzung (Overhead) Lightweight Möglichkeit der Wahrnehmung von Dienstverlustes Flexibel und Skalierbar Einfach zu implementieren und zu verwenden geringer Integrationsaufwand Nachteile Nicht verschlüsselte Kommunikation Eingeschränkte Funktionen Benötigt Broker als zentralen Punkt Kommunikationsparadigma ![[mqtt_Kommunikationsparadigma.webp]]\nSensor Das ist der Sensor, welcher einen Wert auslesen kann. Dabei kommuniziert dieser ausschließlich mit dem MQTT-Broker.\nMQTT-Broker Der MQTT-Broker ist der Publisher in diesem Prinzip. Er hält eine Verbindung mit dem Sensor und leitet den Subscribern den ausgelesenen Wert, unter einem bestimmten Topic, weiter.\nSubscriber Ein Subscriber kann jegliches empfangendes Endgerät sein. Dieses Endgerät kann unter Angabe des Topics den Wert in dem angegebenen Topic erhalten, indem es diesem Topic subscribed.\nTopic und Filterung​ Topic ist eine UTF-8-Zeichenkette​ Hierarchiestufen sind Level und sind optional und dienen der Strukturierung​. Durch diese Struktur ist Filterung möglich (z. B. Auswahl des Subscribers oder Umsetzung eines Berechtigungskonzepts auf dem Broker)​ Level werden durch / getrennt​. Diese werden Topic Level Separator (TLS) genannt. Jedes Topic besteht mindestens aus einem Zeichen​ Auch Leerzeichen sind möglich​ Schreibweise ist case-sensitive + und # innerhalb eines Levels haben eine besondere Bedeutung​ Beispiel Im Folgenden wird bei jedem Topic mindestens das im ersten Beispiel spezifisch genannte Topic abgefragt.\nBS_FFB/Block_A/OG_1/146/Temp1​ BS_FFB/Block_A/+/+/Temp1​ # Ein + ist eine single-level-wildcard BS_FFB/Block_A/#/Temp1​ # Ein # ist eine multi-level-wildcard "},"title":"MQTT"},"/docs/it/netzwerkprotokolle/iot/opc-ua/":{"data":{"":"","#":"Definition: Das OPC UA (OPC Unified Architecture) IoT-Netzwerkprotokoll ist eine Funktechnologie entwickelt von der OPC Foundation. Es wird für IoT-Anwendungen verwendet.\nStandard IEC62541\nÜbertragungsmedium Nutzt bestehende Protokolle, wie WLAN, Ethernet und TSN für die Kommunikation.\nVorteile Plattformunabhängig Verschlüsselte Kommunikation Objektorientierte Datenmodellierung Nachteile Höherer Implementierungsaufwand (als z.B.: [[MQTT]]) Komplexe Zertifikatsverwaltung "},"title":"OPC UA"},"/docs/it/netzwerkprotokolle/ip/":{"data":{"":"","#":"Definition: Das Internet Protocol beschreibt stellt die Grundlage des Internets dar. Dieses Protokoll arbeitet auf Schicht 3 (Übertragungsschicht) des ISO-OSI Schichtenmodells.\nVersionen Es gibt mehrere Versionen des Internet Protokolls. Dies wird beispielsweise durch den Anhang ‘v4’ beschrieben. Folgende Versionen gibt es:\n[[_IPv4]] (32bit) vorherige Versionen fanden keinen Anklang seit 1983 Beispiel: 10.206.128.1 IPv5 Ergänzung zu IPv4 bereits aufgegeben IPv6 (128bit) seit 1998 mehr IP-Adressen Beispiel: fe80::201 IPv7-9 Vorschläge für einen IPv4-Nachfolger bereits aufgegeben Vergabe Öffentliche IP-Adressen werden durch die Internet Assigned Numbers Authority (IANA) vergeben. Ein ISP bietet meist im Geschäftskundenbereich die Einrichtung einer öffentlichen IP an. Dieser hat einen Adressraum bei einer übergeordneten Institution erworben und kann diesen nun verwalten. Eine öffentliche IP-Adresse kann große Vorteile bieten."},"title":"IP"},"/docs/it/netzwerkprotokolle/ip/ipv4/":{"data":{"":"Definition: Die Version 4 des [[Internet Protocol|Internet Protocols]] beschreibt die erste Version des Internet Protocols, welche weltweit stark verbreitet ist. Diese Version bildet unteranderem eine wichtige Grundlage des Internets.","table-of-contents#Table of Contents":" [[#Adressformat|Adressformat]] [[#Netz- und Hostanteil|Netz- und Hostanteil]] [[#Adressknappheit|Adressknappheit]] [[#Öffentliche IP-Adressen|Öffentliche IP-Adressen]] [[#Private IP-Adressen|Private IP-Adressen]] Adressformat IPv4 verwendet eine Adresslänge von 32bit (4 Bytes). Diese wird meist in der Dezimalpunktschreibweise1 angegeben. Dabei wird nach allen 8 Binären (3 Dezimalen) Ziffern ein Punkt zur Verbesserung der Lesbarkeit gesetzt. Jedes Oktett (Zusammenfassung 8 binärer Ziffern) kann 256 Zustände, somit dezimale Werte von 0 (0b0000000) bis 255 (0b11111111), annehmen. Daraus ergibt sich die maximale Anzahl an verschiedenen IP-Adressen (256^4) von 4.294.967.296 IPv4-Adressen.\nNetz- und Hostanteil Dies beschreibt die Position der Trennung der IPv4-Adresse in die beiden Teile des Netzbereichs und Host2anteil. Der Netzbereich beschreibt den Teil der IPv4-Adresse, welcher zur Identifizierung des Adressbereichs des Netzwerks dient. Der Hostanteil beschreibt den Teil der IPv4-Adresse, welcher zur Identifizierung des Adressbereichs der Hosts dient.\nDie Position dieser Trennung der Adresse wird durch die [[IPv4 Subnetzmaske|Subnetzmaske]] definiert.\nAdressknappheit Es gibt eine Anzahl an verschiedenen IP-Adressen (256^4) von 4.294.967.296 IPv4-Adressen. Dies scheint auf den ersten Blick eine große Menge zu sein, jedoch würde dadurch nur jeder zweite Mensch dieser Welt eine IP-Adresse bekommen. Bereits seit 2011 sind alle [[IPv4 Netzklassen]] durch die IANA vergeben worden.\nLösungsansätze: Zur Vermeidung eines Entwicklungsstopps durch die schwindende Menge an IP-Adressen, wurde bereits früh angefangen an Lösungsansätzen zu arbeiten. Folgende Lösungen gibt es:\nNAT (Network Address Translation) IPv6 (Internet Protocol Version 6) Öffentliche IP-Adressen Eine öffentliche IP-Adresse, die meist vom ISP an den Endnutzer vergeben werden und sich entweder regelmäßig ändern oder statisch festgelegt sind, sind im ganzen Internet einzigartig. Weiter ist der besitz einer öffentlichen IP im Gegensatz mit Kosten verbunden. Der Pool an öffentlichen IP-Adressen ist bereits seit 2011 ausgeschöpft. Die öffentlichen IP-Adressen sind in [[IPv4 Netzklassen|Netzklassen]] mit unterschiedlichen Nutzen unterteilt\nPrivate IP-Adressen Gegenüber zu öffentlichen können private IP-Adressen durch den Endnutzer vergeben werden. Hier kann der Endnutzer entscheiden, ob diese Adressen automatisch vergeben werden sollen, oder ob dieser diese statisch selber konfiguriert. Diese Adressen gibt es mehrfach auf der Welt, wodurch diese auch nicht im Internet geroutet werden. Diese Adressen sind dadurch kostenlos. Folgende Adressräume sind reserviert für den Privatgebrauch: - 10.0.0.0/8 - 172.16.0.0/12 - 192.168.0.0/16\neng. Dotted decimal notation ↩︎\nGerät z.B.: ein Client oder Drucker ↩︎"},"title":"IPv4"},"/docs/it/netzwerkprotokolle/ip/ipv4/ipv4-netzklassen/":{"data":{"":"","#":"Definition: Die IPv4 Netzklassen beschreiben die Anzahl der Netzwerkbits in bestimmten Bereichen des ersten Oktetts. Diese unterschiedliche Anzahl wird in Klassen kategorisiert, welche von A beginnend bis E fortlaufen.\n![[IPv4-Netzklassen.png]]\nKlasse A Diese Klasse bietet den größten Hostbereich von allen, mit einer Anzahl von 16,8Mio. Hosts je Netzwerk. Von diesen Netzwerken gibt es nur 128 Stück und diese wurden an große Unternehmen verteilt. Ein Beispiel hierfür ist APNIC mit 1.0.0.0/8 oder AT\u0026T Services mit 12.0.0.0/8, sowie US-Institutionen, wie das DoD Intel Information Systems. Der [[_IPv4#Öffentliche und private IP-Adressen|private Bereich]] in dieser Netzwerkklasse ist 10.0.0.0/8\nKlasse B Diese Klasse bietet eine höhere Verfügbarkeit aufgrund der hohen Anzahl an Netzwerken, währenddessen der Bereich für Hosts je Netzwerk ebenfalls beachtlich ist. Der private Bereich in dieser Netzwerkklasse ist 172.16.0.0/12.\nKlasse C Diese Klasse bietet eine sehr hohe Verfügbarkeit aufgrund der hohen Anzahl an Netzwerken, währenddessen der Bereich für Hosts je Netzwerk gering ist. Der private Bereich in dieser Netzwerkklasse ist 192.168.0.0/16. In diesem Bereich befinden sich meist die Standardbereiche großer Routerhersteller, wie zum Beispiel einer aktuellen Fritz!Box, mit 192.168.178.0/24.\nKlasse D Diese Klasse ermöglicht die gleichzeitige Datenübertragung an mehrere Empfänger durch [[Übertragungsarten#Multicast|Multicast]] und wird hauptsächlich für Streaming und Gruppenkommunikation genutzt.\nKlasse E Diese Klasse ist für experimentelle Zwecke reserviert und ist daher nicht für den öffentlichen Einsatz vorgesehen."},"title":"IPv4 Netzklassen"},"/docs/it/netzwerkprotokolle/ip/ipv4/ipv4-subnetting/":{"data":{"":"","#":"#TODO Definition: IPv4 Subnetting beschreibt den Vorgang der Verkleinerung eines größeren [[_IPv4]] Netzwerkes in ein Netzwerk oder mehrere kleinere Netzwerke mittels einer Änderung der [[IPv4 Subnetzmaske|Subnetzmaske]].\nGründe für Subnetting Netzwerksegmentierung Broadcast-Storm Protection Subnetting Netzklassen Als erstes muss die [[IPv4 Netzklassen]] des Netzwerkes festgestellt werden. Dadurch lässt sich die herausfinden, in welchem Oktett das Subnetting stattfindet.\nHost- und Netzanteil Hostanteil: Dieser beschreibt den Binär-Bereich des IP-Netzwerkes, in"},"title":"IPv4 Subnetting"},"/docs/it/netzwerkprotokolle/ip/ipv4/ipv4-subnetzmaske/":{"data":{"":"#TODO Definition: Die IPv4 Subnetzmaske beschreibt"},"title":"IPv4 Subnetzmaske"},"/docs/it/netzwerkprotokolle/ip/ipv6/":{"data":{"":"#TODO"},"title":"IPv6"},"/docs/it/netzwerkprotokolle/ip/ipv6/ipv6-adresstypen/":{"data":{"":"","#":"#factscheck #TODO\nGlobal Unicast Address (GUA) Von IANA an Regional Internet Registry (RIR) vergebene Netze Adresse wird geroutet Adresse, die der Router vom ISP erhält Range: 2000:: bis 3FFF:: Link Local Unicast Address (LLA) Wird nicht geroutet Jedes Gerät gibt sich diese Adresse eigenständig Jedes IPv6 fähige Gerät muss eine Link Local Unicast Address besitzen Typischerweise nutzen Hosts die Link-Local Unicast Adresse des Routers in Routing-Tabellen als Default Gateway. Range: fe80:: bis febf:: Loopback-Address Vergleichbar mit Loopback (127.0.0.1) bei [[_IPv4|IPv4]] Wird zum Testen oder Diagnose auf lokalem Gerät verwendet Gerät sendet Traffic zurück an sich selbst Range: ::1/128 Unspecified Address Zeigt an, dass keine gültigen IPv6 Adresse vergeben wurde Verwendet als Quell Adresse während der Erstkommunikation (z.B.: Adresskonfiguration) Range = ::/128 Unique Local Unicast Verwendet für private lokale Kommunikation innerhalb des privaten Netzes Wird nicht geroutet Range: fc00:: bis fd00:: "},"title":"IPv6 Adresstypen"},"/docs/it/netzwerkprotokolle/ip/subnetzmaske/":{"data":{"":"","#":"#TODO Definition: Die Subnetzmaske1 beschreibt in Netzwerken den Bereich fest, in welchem der Rechner einen anderen Rechner ohne Router dazwischen erreichen kann. Diese kann binär, dezimal oder hexadezimal. Die Bits der Subnetzmaske, welche den Wert 1 haben, blockieren das Bit in der IP-Adresse an der selben Stelle. Ist ein Bit nicht blockiert, so kann dieses seinen Wert ändern.\nIPv4 Bei [[_IPv4|IPv4]] ist die Subnetzmaske 32 bits (=4 Bytes) lang.\nIPv6 Bei IPv6 ist die Subnetzmaske 128 bits (=16 Bytes) lang.\nCIDR auch Netzmaske, Netzwerkmaske genannt ↩︎"},"title":"Subnetzmaske"},"/docs/it/protocol-data-unit-pdu/":{"data":{"":"","#":"#TODO add every PDU with description Definition: Das Protocol data unit (PDU) ist ein Konzept. Dabei fügt jede Schicht von Schicht 4 beginnend, zu den auf Schicht 7 - 5 generierten sogenannten Nutzdaten, eigene Verwaltungsinformationen hinzu. Dieser Prozess wird auch Kapselung genannt. Der Datensatz erhält nach jeder Kapselung mit den Verwaltungsinformationen der entsprechenden Schicht den Namen (also das PDU), welcher in diesem spezifiziert ist.\nMögliche PDUs UDP-Datagram/TCP-Segment nach Kapselung des Datensatzes auf Schicht 4 Paket nach Kapselung des Datensatzes auf Schicht 3 Frame nach Kapselung des Datensatzes auf Schicht 2 Verwendung von PDUs Durch die Verwendung der korrekten PDUs kann sofort auf die Schicht Rückschlüsse gezogen werden, auf welcher sich dieser Datensatz befindet. Somit ist sofort klar, dass ein Datensatz auf Schicht 3 gemeint ist, wenn als PDU Paket genannt worden ist.\nPDU Visualisierung Dies visualisiert ein vereinfachtes PDU. Dieses enthält nur die wichtigsten Verwaltungsinformationen in der Kapselung jeder Schicht. ![[PDU.svg]]"},"title":"Protocol data unit (PDU)"},"/docs/it/technische-und-organisatorische-ma%C3%9Fnahmen-toms/":{"data":{"":"#TODO\nTOM Ziel Beispiele für eine TOM Zutrittskontrolle Verhindern, dass Unbefugte Zutritt zu den Datenverarbeitungsanlagen haben. Alarmanlage\nPförtner Zugangskontrolle Verhindern, dass Unbefugte Datenverarbeitungsanlagen nutzen können. Passwortverfahren Verschlüsselung Zugriffskontrolle Gewährleisten, dass nur Berechtigte auf Daten zugreifen können und diese nicht unbefugt gelesen, verändert, kopiert oder entfernt werden können. Berechtigungskonzepte Protokollierung Weitergabekontrolle Gewährleisten, dass Daten bei der elektronischen Übertragung/Transport nicht unbefugt gelesen, kopiert, verändert oder entfernt werden können. Verschlüsselung VPN Eingabekontrolle Gewährleisten, dass nachträglich überprüft werden kann, ob und wer Daten verändert oder entfernt hat. Protokollierung Protokollauswertungssysteme Auftragskontrolle Gewährleisten, dass Daten, die im Auftrag verarbeitet werden, nur entsprechend den Anweisungen des Auftraggebers verarbeitet werden können. Vertragsgestaltung bei ADV Kontrollen Verfügbarkeitskontrolle Gewährleisten, dass Daten gegen zufällige Zerstörung oder Verlust geschützt sind. Datensicherung/Backup Firewall/Virenschutz Trennungsgebot Gewährleisten, dass zu unterschiedlichen Zwecken erhobene Daten getrennt verarbeitet werden Mandanten Trennung der Systeme "},"title":"Technische und organisatorische Maßnahmen (TOMs)"},"/docs/it/uml/":{"data":{"":"","#":"#TODO Definition: Die UML (Unified Modeling Language) ist eine grafische Modellierungssprache zur Dokumentation und Visualisierung von Software und anderen Systemen. Diese ist zum Beispiel in der Version 2.4.1 in der ISO/IEC 19505 genormt. Diese legt Begriffe bei der Modellierung und mögliche Beziehungen zwischen diesen Begriffen fest. Die UML ist die dominierende Sprache für die Softwaresystem-Modellierung.\nDiagrammtypen Es gibt verschiedenste UML Diagrammtypen, wie beispielsweise das [[UML Aktivitätsdiagramm]] oder das [[UML Anwendungsfalldiagramm]]."},"title":"UML"},"/docs/it/uml/uml-aktivit%C3%A4tsdiagramm/":{"data":{"":"#TODO #Diagramm Definition: Das UML Aktivitätsdiagramm ist ein Modellelement in der [[UML]] und beschreibt Abläufe von Operationen und Prozessen darzustellen. Im Gegensatz zu den klassischen Programmablaufplänen (PAP) bzw. Struktogrammen gibt es zusätzlich einen parallelen Kontrollfluss.","table-of-contents#Table of Contents":" [[#Schema|Schema]] [[#Paralleler Kontrollfluss|Paralleler Kontrollfluss]] [[#Alternativer Kontrollfluss|Alternativer Kontrollfluss]] [[#Beispiel|Beispiel]] Schema ![[UML-Aktivitätsdiagramm-Schema.png]]\nParalleler Kontrollfluss Zu einem Parallelen Kontrollfluss führt ein dicker schwarzer Balken. Dieser spaltet den Kontrollfluss in mehrere Programmfäden auf. Dieses Symbol nennt sich ‘Parallelisierung’. In allen davon ausgehenden Kontrollflüssen laufen die Aktionen unabhängig von einander ab. Durch eine erneute Verwendung des schwarzen Balkens können diese wieder synchronisiert werden. Dieses Symbol nennt sich ‘Synchronisation’. Wenn alle Aktionen aller eingehenden Programmstränge ausgeführt wurden, wird der Kontrollfluss fortgesetzt.\nAlternativer Kontrollfluss Durch das Symbol einer Raute wird der Kontrollfluss alternativ durch eine Entscheidung verzweigt. Die Verzweigungsbedingung wird neben den ausgehenden Linien in eckigen Klammern (auch guards genannt) geschrieben. Eine Zusammenführung alternativer Programmabläufe muss ebenfalls über eine Raute erfolgen.\nBeispiel Aufgabenstellung Weißwurstfrühstück: Am Schuljahresende ist in Ihrer Klasse ein Weißwurstfrühstück angesagt: Zunächst werden in Ihrer Klasse die Aufgaben verteilt. Um noch vor 11 Uhr die Weißwürste vertilgen zu können, werden 4 Gruppen gebildet, die gleichzeitig loslegen. Gruppe 1 kümmert sich in der Küche um das Erhitzen des Wassers. Gruppe 2 besorgt beim Metzger Weißwürste, während Gruppe 3 sich um die Brezen kümmert. Wenn das Wasser erhitzt ist und die Weißwürste besorgt wurden, kann mit dem Kochen der Weißwürste begonnen werden. Gruppe 4 ist für alle weiteren Besorgungen zuständig. (Senf, Weißbier, Servietten, etc.). Sie geht dabei folgendermaßen vor: Zunächst sucht sie einen Supermarkt und kauft schließlich dort ein. Hat sie alle Zutaten bekommen, kehrt sie zur Schule zurück, ansonsten sucht sie solange einen weiteren Supermarkt und kauft dort ein bis alle Besorgungen erledigt sind. Nachdem alle Gruppen mit Ihren Aufgaben fertig sind, beginnt das Weißwurstfrühstück. Modelliere den obigen Prozess mittels eines UML-Aktivitätsdiagramms ohne Schwimmbahnen! ![[UML-Aktivitätsdiagramm-Beispiel.png]]"},"title":"UML Aktivitätsdiagramm"},"/docs/it/uml/uml-anwendungsfalldiagramm/":{"data":{"":"#Diagramm Definition: Das UML Anwendungsfalldiagramm (auch Use Case Diagramm genannt) ist ein Modellelement in der [[UML]] und beschreibt die Zusammenhänge zwischen einer Menge von Anwendungsfällen und den daran beteiligten Akteuren. Dabei stellt dieses das externe Verhalten des Systems in einer bestimmten Situation dar. Ein Anwendungsfall beschreibt, was das System leisten muss, aber nicht wie es das leisten soll.","table-of-contents#Table of Contents":" [[#Schema|Schema]] [[#Schema#Akteur|Akteur]] [[#Schema#System|System]] [[#Schema#Assoziation|Assoziation]] [[#Beziehungen|Beziehungen]] [[#Beziehungen#Include|Include]] [[#Beziehungen#Extend|Extend]] [[#Beziehungen#Generalisierung|Generalisierung]] [[#Beispiel|Beispiel]] Schema ![[UML-Anwendungsfalldiagramm-Schema.png]]\nAkteur menschliche Akteure\nSystem nicht menschliche Akteure / Systeme\nAssoziation Akteure besitzen Assoziationen zu Anwendungsfällen, wenn sie an den dort beschriebenen Abläufen aktiv oder passiv beteiligt sind.\nBeziehungen Zwischen den Anwendungsfällen kann es folgende 3 verschiedene Arten von Beziehungen geben, die durch die Beschriftung und die verschiedene Pfeilarten unterschieden werden.\nInclude Durch die include-Beziehung wird dargestellt, dass innerhalb eines Anwendungsfalls 1 ein anderer Anwendungsfall 2 vorkommt. Der Anwendungsfall 2 wird immer ausgeführt, wenn der erste Anwendungsfall eintritt. Eine include-Beziehung wird mit \u003c\u003cinclude\u003e\u003e angegeben. Bei include-Beziehung zeigt die Pfeilspitze immer auf den Anwendungsfall, um welchen der eigentliche Anwendungsfall erweitert wird.\nExtend Durch die extend-Beziehung wird dargestellt, dass innerhalb eines Anwendungsfalls 1 ein anderer Anwendungsfall 2 vorkommt. Der Anwendungsfall 2 wird unter bestimmten Umständen ausgeführt, wenn der erste Anwendungsfall eintritt. Dieser Umstand (Bedingung) wird als Notiz an die extend-Beziehung angehängt. Diese Beziehung eignet sich, zur Darstellung von optionalem Verhalten. Eine exclude-Beziehung wird mit \u003c\u003cexclude\u003e\u003e angegeben, sowie mit der Bedingung. Die Pfeilspitze von extend-Beziehung zeigt immer auf den Anwendungsfall, um welchen beim Eintreten der Bedingung erweitert werden kann.\nGeneralisierung Durch die Generalisierung werden Spezialfälle A und B Verhalten und Bedeutung vom Anwendungsfall 1 erben. Damit ist Anwendungsfall 1 eine Verallgemeinerung der Spezialfälle. Die Generalisierung ist die einzige Beziehung, welche zwischen Akteuren auftritt.\nBeispiel Aufgabestellung Terminvergabe: Sie arbeiten im Projekt zur Entwicklung einer Software zur Terminvergabe in Arztpraxen mit. Bei der Analyse ergeben sich folgende Anforderungen:\nMit dem Buchungssystem können Patienten und Angestellte der Ärzte arbeiten. Für das Buchungssystem ist ein vorheriger Login erforderlich. Patienten können Termine anfragen. Patienten können bei Bedarf aus einer Liste eine spezielle Terminart auswählen. Ein Angestellter muss eine Terminanfrage abschließen (bestätigen oder absagen). Hierzu muss dieser sich zuerst eine Liste aller Terminanfragen anzeigen lassen. Bei dem Abschließen der Terminanfrage muss der Angestellte, wenn eine spezielle Terminart ausgewählt wurde, die Ressourcen planen. Erstellen Sie ein Anwendungsfalldiagramm anhand der beschriebenen Anforderungen. ![[UML-Anwendungsfalldiagramm-Beispiel.png]]"},"title":"UML Anwendungsfalldiagramm"},"/docs/it/uml/uml-klassendiagramm/":{"data":{"":"#Diagramm Definition: Das UML Klassendiagramm ist ein Strukturdiagramm der [[UML]] und dient zur grafischen Darstellung von von Klassen sowie deren Beziehungen.","table-of-contents#Table of Contents":" [[#Schema|Schema]] [[#Schema#Klassenname|Klassenname]] [[#Schema#Variablenname|Variablenname]] [[#Schema#Variablentyp|Variablentyp]] [[#Schema#Sichtbarkeit|Sichtbarkeit]] [[#Schema#Konstruktor|Konstruktor]] [[#Schema#Attribute|Attribute]] [[#Schema#Methoden|Methoden]] [[#Vererbung|Vererbung]] [[#Vererbung#protected ( )|protected (#)]] Schema ![[UML-Klassendiagramm-Schema.png]]\nKlassenname Der Klassenname ist der Name, welchen diese Klasse im Programm erhalten soll. In Java sollten Klassen immer mit einem Großbuchstaben beginnen.\nBeispiel zu obigem Schema:\npublic class Auto Variablenname Der Variablenname ist der Name, welchen diese Variable im Programm erhalten soll. In Java sollten Variablen immer mit einem Kleinbuchstaben beginnen.\nVariablentyp Der Variablenname ist der Typ, von welchem diese Variable ist.\nSichtbarkeit Die Sichtbarkeit beschreibt die Sichtbarkeit von Variablen und Methoden. Dabei steht ein +, - oder # für die Sichtbarkeiten public, private und protected.\nUML Sichtbarkeit Java Sichtbarkeit + public - private # [[UML Klassendiagramm#protected ( )|protected]] Konstruktor Der Konstruktor ist eine spezielle Methode, welche zur Bildung der Klasse dient. Dieser muss immer genau den Namen der Klasse haben. Ein Konstruktor ist immer public und hat keinen Rückgabewert (auch nicht void). Mehrere Konstruktoren sind ebenfalls möglich.\nBeispiel zu obigem Schema:\npublic Auto() { kmStand = 0.0; System.out.println(\"Ein neues Auto\") } Attribute Die Attribute sind alle Variablen, welche im oberen Teil des UML Klassendiagramms genannt werden. Diese Attribute haben meist die [[UML Klassendiagramm#Sichtbarkeit|Sichtbarkeit]] private\nBeispiel zu obigem Schema:\nprivate String marke: private double kmStand; Methoden Die Methoden sind alle Einträge, welche im unteren Teil des UML Klassendiagramms genannt werden, sowie der [[UML Klassendiagramm#Konstruktor|Konstruktor]].\nVererbung Durch das Konzept der Vererbung ist es möglich, Attribute und Methoden einer Oberklasse (auch Superklasse oder Basisklasse genannt), an mehrere, speziellere Unterklassen zu vererben. Die Unterklassen (auch Subklassen genannt) besitzen dann automatisch alle Attribute und Methoden der Oberklasse, die nicht auf private gesetzt sind. Im UML-Klassendiagramm wird die Vererbungsbeziehung (auch is-a-Beziehung genannt) durch einen Pfeil mit nicht ausgefüllter Spitze dargestellt, der von der Unter- zur Oberklasse zeigt.\nprotected (#) Die [[UML Klassendiagramm#Sichtbarkeit|Sichtbarkeit]] protected (gekennzeichnet durch #) bewirkt, dass Attribute oder Methoden sowohl in der definierenden Klasse selbst als auch in all ihren Unterklassen sichtbar sind. Alle anderen Klassen können nicht auf sie zugreifen. Bei public könnten stattdessen alle Klassen auf diese zugreifen und bei private nur die definierende Klasse."},"title":"UML Klassendiagramm"},"/docs/pug/ausbildungsvertrag/":{"data":{"":"","#":"Definition: Der Ausbildungsvertrag1 beschreibt den Vertrag zwischen dem Auszubildenden (Schüler)2 und dem Ausbildenden (Betrieb). Durch diesen entsteht ein Berufsausbildungsverhältnis.\nInhalt eines Ausbildungsvertrag Ausbildungsdauer Bestandteile der Vergütung und sonstige Leistungen Pflichten des Auszubildenden Pflichten des Ausbildenden Ausbildungsstätte Ermächtigung zur Anmeldung zur Prüfung Ausbildungszeit, Anrechnung und [[Bundesurlaubsgesetzes (BUrlG)#^d10476|Urlaub]] Kündigung Betriebliches Zeugnis Beilegung von Streitigkeiten Erfüllungsort Sonstige Vereinbarungen; Hinweis auf Betriebs- bzw. Dienstvereinbarungen Wichtige Eigenschaften eines Ausbildungsvertrag Abschluss des Ausbildungsvertrag muss schriftlich erfolgen Die Dauer der Probezeit ist gesetzlich3 auf 1 - 4 Monate geregelt\nPflichten und Rechte des Auszubildenden Pflichten:\nEinhaltung der [[Arbeitszeitgesetz (ArbZG)#^1b4a2a|Pause]] Lernpflicht Weisungsgebundenheit Betriebliche Ordnung Sorgfaltspflicht Betriebsgeheimnisse Führen eines schriftlichen Ausbildungsnachweises Erholungspflicht Rechte:\nAusbildungspflicht Freistellung für Berufsschulunterricht Freistellung für außerbetriebliche Ausbildung Anmeldung/Freistellung für Prüfungen Aufsichtspflicht Bereitstellung der Ausbildungsmittel Urlaubsgewährung Vergütungspflicht Zeugnispflicht Zweckgebundene Übertragung von Aufgaben Ausbildungsbezogene Tätigkeiten übertragen Charakterliche Förderung Vermeidung körperlicher Gefährdung Fachlich geeigneter Ausbilder , auch Berufsausbildungsvertrag genannt ↩︎\nBei Bedarf ein gesetzlicher Vertreter, wie beispielsweise Eltern ↩︎\n§20 BBiG ↩︎"},"title":"Ausbildungsvertrag"},"/docs/pug/das-duale-berufsausbildungssystem/":{"data":{"":"","#":"Definition: Das duale Berufsausbildungssystem beschreibt die Berufsausbildung an zwei Lernorten (Ausbildungsbetrieb und Berufsschule) mit einem übergreifenden Lernprozess.\nLernorte: Ausbildungsbetrieb: Berufsschule: Gesetzlich Grundlage: BBiG: Berufsbildungsgesetz\n-Ausbildungsordnungen\n- Handwerksordnung BayEUG: Bayerisches Gesetz über das Erziehungs- und Unterrichtswesen\nBaySchO: Schulordnung für schulartübergreifende Regelungen an Schulen in Bayern\nBayBSO: Schulordnung für die Berufsschulen in Bayern Aufgabenteilung: Praxis Theorie JArbSchG\nBei Kindern und Jugendlichen gilt zusätzlich das [[Jugendarbeitsschutzgesetzes (JArbSchG)]]\nVor- und Nachteile des Berufsausbildungssystem Vorteile:\neigenes Gehalt Lernen von Theorie und Praxis Austauschmöglichkeit mit Berufsschulkollegen geringe Jugendarbeitslosigkeit strukturierter Ausbildungsablauf Nachteile:\nDer Auszubildende wird immer wieder aus betrieblichen Abläufen heraus gerissen meistens werden gleichzeitig unterschiedliche Themen an beiden Lernort behandelt Lernstress hohe Kosten für Staat und Betrieb Betrieb fehlt eine Arbeitskraft Ländervergleich Schulische Ausbildung Polen Niederlande Italien Duale Ausbildung Deutschland Österreich Frankreich Betriebliche Ausbildung United States of America Japan Tschechien "},"title":"Das duale Berufsausbildungssystem"},"/docs/pug/gesetze/arbeitszeitgesetz-arbzg/":{"data":{"":"","#":"Definition: Das Arbeitszeitgesetz (ArbZG) regelt die Arbeitszeiten von Arbeitnehmern. Es dient dem Gesundheitsschutz und der Arbeitszeiterfassung der Arbeitnehmenden.\nWichtige Regelungen Arbeitszeit (§2) : Zeit von Arbeitsbeginn bis -ende ohne Pausen. Nachtzeit ist von 23 bis 6 Uhr (bei Bäckereien von 22 bis 5 Uhr). Arbeitszeitbegrenzung (§3): Tägliche Arbeitszeit darf 8 Stunden nicht überschreiten, kann auf 10 Stunden verlängert werden, wenn im Durchschnitt 8 Stunden nicht überschritten werden. Ruhepausen (§4): Mindestens 30 Minuten bei einer Arbeitszeit von mehr als 6 bis 9 Stunden, 45 Minuten bei mehr als 9 Stunden. Keine Arbeit über 6 Stunden ohne Pause. ^1b4a2a Ruhezeit (§5): Ununterbrochene Ruhezeit von mindestens 11 Stunden nach Arbeitsende. Abweichende Regelungen (§7): Tarifverträge können von den allgemeinen Regelungen abweichen. Sonn- und Feiertagsruhe (§9): Beschäftigung an Sonn- und Feiertagen ist grundsätzlich verboten, außer in bestimmten Ausnahmen wie Notdiensten oder bei der öffentlichen Sicherheit. Sonn- und Feiertagsbeschäftigung (§10): Beschäftigung an Sonn- und Feiertagen wenn nötig möglich. 1 Ausgleich für Sonn- und Feiertagsarbeit (§11): Ersatzruhetag für Arbeit an Sonn- und Feiertagen, mit Fristen zur Gewährung. Nichtanwendung (§18): Für unter 18-Jährige gilt das Jugendarbeitsschutzgesetz. z.B.: Feuerwehr, Not- und Rettungsdienst und Gaststätten ↩︎"},"title":"Arbeitszeitgesetz (ArbZG)"},"/docs/pug/gesetze/bundesurlaubsgesetzes-burlg/":{"data":{"":"","#":"Definition: Das Bundesurlaubsgesetz (BUrlG) regelt den Anspruch auf bezahlten Erholungsurlaub für Arbeitnehmer. Ziel ist der Schutz der Gesundheit und Erholung der Beschäftigten.\nWichtige Regelungen Urlaubsanspruch (§1): Jeder Arbeitnehmer hat Anspruch auf bezahlten Erholungsurlaub. Mindesturlaub (§3): 24 Werktage bei einer 6-Tage-Woche, 20 Tage bei einer 5-Tage-Woche. ^d10476 Wartezeit (§4): Der volle Urlaubsanspruch entsteht nach sechs Monaten Betriebszugehörigkeit. Teilurlaub (§5): Bei Nichterfüllung der Wartezeit besteht Anspruch auf anteiligen Urlaub. Urlaubszeitpunkt \u0026 Übertragbarkeit (§7): Urlaub soll zusammenhängend gewährt werden, unter Berücksichtigung betrieblicher Erfordernisse. Nicht genommener Urlaub ist bei Beendigung des Arbeitsverhältnisses abzugelten. Der Jahresurlaub kann aus dringlichen Gründen bis zum März des nächsten Jahres übernommen werden. Erwerbstätigkeit im Urlaub (§8): Keine dem Erholungszweck widersprechende Arbeit erlaubt. Erkrankung im Urlaub (§9): Krankheitsbedingte Fehltage werden nicht auf den Urlaub angerechnet. "},"title":"Bundesurlaubsgesetzes (BUrlG)"},"/docs/pug/gesetze/jugendarbeitsschutzgesetzes-jarbschg/":{"data":{"":"","#":"Definition: Das Jugendarbeitsschutzgesetz (JArbSchG) schützt die Gesundheit und Entwicklung von Kindern und Jugendlichen in der Arbeitswelt.\nWichtige Regelungen: Geltungsbereich (§1–2): Schutz für Kinder (unter 15 Jahren) und Jugendliche (15–17 Jahre). Arbeitszeit \u0026 Pausen (§4–12): Max. 8 Stunden/Tag, 5-Tage-Woche, geregelte Ruhezeiten, Nachtruhe und Pausen. Ruhezeiten (§13–17): Tägliche Freizeit, Nachtruhe, freie Samstage und Sonntage. Urlaub (§19): Altersabhängige Mindesturlaubstage. Berufsschule \u0026 Prüfungen (§9–10): Freistellung für Bildung. Gefährliche Arbeiten (§22): Verbot von Tätigkeiten, die die Gesundheit gefährden. Gesundheitsvorsorge (§32): Pflichtuntersuchungen vor Arbeitsbeginn. Das Gesetz stellt sicher, dass junge Menschen gesund und sicher arbeiten können, ohne ihre Entwicklung oder Bildung zu gefährden."},"title":"Jugendarbeitsschutzgesetzes (JArbSchG)"}}